{
  "Mario": "Mario is Nintendo's iconic mascot and one of the most recognizable video game characters worldwide. The cheerful plumber from the Mushroom Kingdom has been saving Princess Peach from Bowser since 1985. Known for his red cap, blue overalls, and legendary jumping ability, Mario has starred in countless platformers, racing games, sports titles, and party games.",
  "Link": "Link is the courageous hero of The Legend of Zelda series. Wielding the Master Sword and carrying the Hylian Shield, Link embarks on epic quests to rescue Princess Zelda and defeat the dark lord Ganon. Though often silent, his bravery and determination have made him one of gaming's most beloved heroes across multiple timelines and incarnations.",
  "Pikachu": "Pikachu is the most famous Pokémon and the franchise's mascot. This Electric-type mouse Pokémon is known for its lightning bolt-shaped tail, rosy cheeks, and signature \"Pika Pika!\" cry. As Ash Ketchum's loyal partner in the anime, Pikachu has become a global icon representing the entire Pokémon universe.",
  "Kirby": "Kirby is the adorable pink puffball from Planet Popstar. Despite his cute appearance, Kirby is a powerful hero who can inhale enemies and copy their abilities. With an insatiable appetite and boundless courage, Kirby has protected Dream Land from countless threats, from King Dedede to Dark Matter.",
  "Samus Aran": "Samus Aran is the legendary bounty hunter and protagonist of the Metroid series. Clad in her iconic Varia Suit and wielding the Arm Cannon, Samus explores hostile alien worlds and hunts the dangerous Metroids. Raised by the Chozo and trained as a warrior, she's one of gaming's first female protagonists and remains one of the most iconic.",
  "Princess Zelda": "Princess Zelda is the wise and powerful ruler of Hyrule. As the bearer of the Triforce of Wisdom, she often aids Link in his quest to defeat Ganon. Across different timelines, Zelda has taken many forms—from a ninja in disguise (Sheik) to a pirate captain (Tetra)—but always plays a crucial role in protecting Hyrule from darkness.",
  "Princess Peach": "Princess Peach is the benevolent ruler of the Mushroom Kingdom. Though frequently kidnapped by Bowser, Peach is far from helpless—she's a skilled athlete, go-kart racer, and even rescued Mario in Super Princess Peach. Her grace, kindness, and iconic pink dress have made her a beloved character for decades.",
  "Bowser": "Bowser, also known as King Koopa, is the primary antagonist of the Mario series. This fire-breathing turtle tyrant rules the Koopa Kingdom and has made kidnapping Princess Peach his life's work. Despite being Mario's arch-nemesis, Bowser occasionally teams up with the heroes and even shows a softer side as a devoted father to Bowser Jr.",
  "Donkey Kong": "Donkey Kong is the powerful leader of the Kong family and guardian of Donkey Kong Island's banana hoard. This mighty gorilla combines incredible strength with surprising agility. Originally appearing as the antagonist in the 1981 arcade game, DK has since become one of Nintendo's most beloved heroes, starring in his own platforming adventures.",
  "Fox McCloud": "Fox McCloud is the leader of Star Fox, an elite team of fighter pilots. Flying his signature Arwing through the Lylat System, Fox battles the evil forces of Andross to protect the galaxy. The skilled pilot follows in his father's footsteps, combining sharp tactical thinking with exceptional piloting abilities.",
  "Yoshi": "Yoshi is Mario's loyal dinosaur companion and the hero of Yoshi's Island. Known for his long tongue, ability to eat nearly anything, and signature ground pound, Yoshi comes in many colors. His cheerful nature and willingness to help make him one of Mario's most trusted friends.",
  "Inkling": "Inklings are the squid-kid protagonists of the Splatoon series. These fashionable fighters can transform between humanoid and squid forms, using various ink-based weapons in turf wars. Inklings represent youth culture, creativity, and the competitive spirit of Splatoon's colorful ink battles.",
  "Villager": "The Villager is the customizable protagonist of Animal Crossing. Moving to a new town with nothing but the clothes on their back, the Villager befriends animal neighbors, catches bugs and fish, decorates their home, and builds a peaceful community. Despite their cute appearance, the Villager is a surprisingly fierce fighter in Super Smash Bros.",
  "Lucario": "Lucario is a Fighting/Psychic-type Pokémon known for its ability to sense and manipulate Aura. This bipedal canine Pokémon can read others' thoughts and emotions through Aura waves. Lucario's signature move, Aura Sphere, and its Mega Evolution make it a formidable fighter in both Pokémon battles and Super Smash Bros.",
  "Mega Man": "Mega Man is the heroic robot created by Dr. Light to fight the evil Dr. Wily. Originally known as Rock, he was transformed into a fighting robot with the ability to copy defeated Robot Masters' weapons. Mega Man's iconic Mega Buster and determination to protect humanity have made him a legendary gaming icon since 1987.",
  "Shovel Knight": "Shovel Knight is the indie gaming icon who wields the Shovel Blade. This knight of the Blue Order embarks on a quest to rescue his beloved Shield Knight and defeat the evil Enchantress. Combining classic 8-bit aesthetics with modern game design, Shovel Knight has become one of the most celebrated indie characters.",
  "Cloud Strife": "Cloud Strife is the spiky-haired mercenary and protagonist of Final Fantasy VII. Wielding the massive Buster Sword and possessing superhuman abilities from Mako energy, Cloud fights against the Shinra Corporation and the legendary SEPHIROTH. His journey from mercenary to hero is one of gaming's most iconic stories.",
  "Isabelle": "Isabelle is the cheerful, hardworking secretary from Animal Crossing. This dedicated Shih Tzu assists the player in managing their town, from public works projects to town ordinances. Despite her sweet demeanor and love of bells and fishing, Isabelle proves to be a surprisingly capable fighter in Super Smash Bros.",
  "Ridley": "Ridley is the cunning and ruthless leader of the Space Pirates and Samus Aran's arch-nemesis. This pterodactyl-like alien destroyed Samus's home and killed her parents, making him one of gaming's most personal villains. Ridley's intelligence, ferocity, and ability to regenerate make him a terrifying recurring threat in the Metroid series.",
  "King Dedede": "King Dedede is the self-proclaimed king of Dream Land. While often portrayed as Kirby's rival or antagonist, Dedede isn't truly evil—he's pompous, greedy, and loves food, but occasionally helps Kirby save Dream Land. Armed with his trusty hammer and ability to inhale like Kirby, he's both a formidable opponent and reluctant ally."
}
