{
  "A.K.I": "A.K.I is a fighter from the Street Fighter series. As one of the world warriors, A.K.I competes in global tournaments testing martial arts mastery. Street Fighter pioneered competitive fighting games with its diverse cast and deep combat mechanics.",
  "Ace": "Ace is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Ace lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Admiral": "Admiral is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Admiral lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Agent S": "Agent S is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Agent S lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Agnes": "Agnes is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Agnes lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Akuma": "Akuma is a fighter from the Street Fighter series. As one of the world warriors, Akuma competes in global tournaments testing martial arts mastery. Street Fighter pioneered competitive fighting games with its diverse cast and deep combat mechanics.",
  "Al": "Al is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Al lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Alex": "Alex is one of the playable characters in Minecraft, introduced as a default skin alongside Steve. Representing the diverse player base, Alex explores, mines, crafts, and builds in the infinite procedurally generated world of Minecraft.",
  "Alfonso": "Alfonso is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Alfonso lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Alice": "Alice is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Alice lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Alli": "Alli is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Alli lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Alm": "Alm is a character from the Fire Emblem series. As part of the tactical RPG franchise, Alm may be a warrior, mage, or leader who participates in strategic battles and complex storylines involving kingdoms, dragons, and legendary weapons. Fire Emblem is renowned for its deep character development and permanent death mechanics.",
  "Amelia": "Amelia is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Amelia lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Anabelle": "Anabelle is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Anabelle lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Anchovy": "Anchovy is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Anchovy lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Angus": "Angus is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Angus lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Anicotti": "Anicotti is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Anicotti lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Ankha": "Ankha is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Ankha lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Annalisa": "Annalisa is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Annalisa lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Annalise": "Annalise is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Annalise lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Antonio": "Antonio is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Antonio lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Apollo": "Apollo is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Apollo lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Apple": "Apple is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Apple lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Asana Mutsuba": "Asana Mutsuba is from the Yu-Gi-Oh! franchise, the popular trading card game and anime series. Yu-Gi-Oh! features duelists summoning monsters and casting spells in strategic card battles.",
  "Astrid": "Astrid is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Astrid lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Audie": "Audie is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Audie lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Aurora": "Aurora is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Aurora lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Ava": "Ava is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Ava lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Avery": "Avery is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Avery lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Axel": "Axel is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Axel lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Azalea": "Azalea is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Azalea lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Baabara": "Baabara is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Baabara lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Baby Luigi": "Baby Luigi is a playable character in Mario Sports Superstars. Competing in various sports including soccer, baseball, tennis, golf, and horse racing, Baby Luigi brings their unique skills to the competitive world of Mario sports. The game celebrates athletic competition in the Mushroom Kingdom.",
  "Baby Mario": "Baby Mario is a playable character in Mario Sports Superstars. Competing in various sports including soccer, baseball, tennis, golf, and horse racing, Baby Mario brings their unique skills to the competitive world of Mario sports. The game celebrates athletic competition in the Mushroom Kingdom.",
  "Bam": "Bam is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Bam lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Bangle": "Bangle is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Bangle lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Banjo": "Banjo is the easy-going bear protagonist of the Banjo-Kazooie series. Partnered with the wisecracking bird Kazooie who lives in his backpack, Banjo embarks on adventures to stop the evil witch Gruntilda. This duo became icons of the N64 era with their collect-a-thon platforming adventures.",
  "Barioth": "Barioth is from the Monster Hunter series. In this world, hunters track and battle massive creatures using an arsenal of weapons and strategies. Monster Hunter is celebrated for its challenging combat and emphasis on preparation and teamwork.",
  "Barold": "Barold is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Barold lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Bayonetta": "Bayonetta is from the Bayonetta series, featuring stylish action combat and over-the-top set pieces. The series is known for its witch protagonist who battles angels and demons with magical hair attacks and time-manipulating abilities.",
  "Bea": "Bea is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Bea lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Beardo": "Beardo is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Beardo lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Beau": "Beau is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Beau lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Becky": "Becky is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Becky lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Bella": "Bella is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Bella lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Benedict": "Benedict is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Benedict lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Benjamin": "Benjamin is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Benjamin lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Bertha": "Bertha is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Bertha lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Bettina": "Bettina is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Bettina lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Bianca": "Bianca is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Bianca lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Biff": "Biff is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Biff lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Big Man": "Big Man is associated with the Splatoon series. In the colorful, ink-based world of turf wars, Big Man represents the fresh and vibrant culture of Inkopolis. Splatoon is celebrated for its unique ink-based gameplay mechanics and fashion-forward style.",
  "Big Top": "Big Top is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Big Top lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Bill": "Bill is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Bill lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Billy": "Billy is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Billy lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Birdo": "Birdo is a playable character in Mario Sports Superstars. Competing in various sports including soccer, baseball, tennis, golf, and horse racing, Birdo brings their unique skills to the competitive world of Mario sports. The game celebrates athletic competition in the Mushroom Kingdom.",
  "Biskit": "Biskit is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Biskit lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Bitty": "Bitty is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Bitty lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Blaire": "Blaire is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Blaire lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Blanca": "Blanca is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Blanca lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Blanche": "Blanche is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Blanche lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Blanka": "Blanka is a fighter from the Street Fighter series. As one of the world warriors, Blanka competes in global tournaments testing martial arts mastery. Street Fighter pioneered competitive fighting games with its diverse cast and deep combat mechanics.",
  "Blathers": "Blathers is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Blathers lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Bluebear": "Bluebear is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Bluebear lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Bob": "Bob is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Bob lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Bokoblin": "Bokoblin is a character from The Legend of Zelda series. As part of the rich world of Hyrule and beyond, Bokoblin plays a role in the epic adventures featuring Link, Zelda, and the battle against darkness. The Zelda series is known for its intricate lore and memorable characters.",
  "Bonbon": "Bonbon is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Bonbon lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Bones": "Bones is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Bones lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Boo": "Boo is a character from the Super Mario series. As part of the colorful Mushroom Kingdom, Boo joins Mario and friends in adventures filled with platforming challenges, power-ups, and battles against Bowser's forces. The Mario universe is known for its cheerful atmosphere and creative gameplay.",
  "Booker": "Booker is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Booker lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Boomer": "Boomer is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Boomer lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Boone": "Boone is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Boone lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Boots": "Boots is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Boots lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Boris": "Boris is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Boris lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Bowser": "Bowser, also known as King Koopa, is the primary antagonist of the Mario series. This fire-breathing turtle tyrant rules the Koopa Kingdom and has made kidnapping Princess Peach his life's work. Despite being Mario's arch-nemesis, Bowser occasionally teams up with the heroes and even shows a softer side as a devoted father to Bowser Jr.",
  "Bowser Jr.": "Bowser Jr. is Bowser's mischievous son and heir to the Koopa Kingdom. Often piloting his Junior Clown Car or transforming into Shadow Mario, Bowser Jr. follows in his father's footsteps by causing trouble for Mario and friends. Despite his villainous role, he shows genuine love for his father.",
  "Boyd": "Boyd is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Boyd lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Bree": "Bree is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Bree lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Brewster": "Brewster is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Brewster lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Broccolo": "Broccolo is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Broccolo lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Broffina": "Broffina is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Broffina lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Bruce": "Bruce is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Bruce lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Bubbles": "Bubbles is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Bubbles lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Buck": "Buck is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Buck lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Bud": "Bud is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Bud lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Bunnie": "Bunnie is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Bunnie lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Butch": "Butch is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Butch lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Buzz": "Buzz is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Buzz lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Byleth": "Byleth is the protagonist of Fire Emblem: Three Houses, serving as a professor at the Garreg Mach Monastery. Wielding the Sword of the Creator and possessing the mysterious Crest of Flames, Byleth guides one of three houses through war and political intrigue. Their tactical brilliance shapes the fate of Fódlan.",
  "C. Viper": "C. Viper is a fighter from the Street Fighter series. As one of the world warriors, C. Viper competes in global tournaments testing martial arts mastery. Street Fighter pioneered competitive fighting games with its diverse cast and deep combat mechanics.",
  "C.J.": "C.J. is a villager from the Animal Crossing series. As part of the diverse community of animal friends, C.J. lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Callie": "Callie is associated with the Splatoon series. In the colorful, ink-based world of turf wars, Callie represents the fresh and vibrant culture of Inkopolis. Splatoon is celebrated for its unique ink-based gameplay mechanics and fashion-forward style.",
  "Cally": "Cally is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Cally lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Cammy": "Cammy is a fighter from the Street Fighter series. As one of the world warriors, Cammy competes in global tournaments testing martial arts mastery. Street Fighter pioneered competitive fighting games with its diverse cast and deep combat mechanics.",
  "Camofrog": "Camofrog is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Camofrog lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Canberra": "Canberra is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Canberra lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Candi": "Candi is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Candi lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Captain Falcon": "Captain Falcon is the legendary F-Zero pilot and bounty hunter. Known for his racing prowess in the Blue Falcon and his powerful Falcon Punch, Captain Falcon has become an icon of speed and strength. His flashy moves in Super Smash Bros. have made him one of gaming's most memorable fighters.",
  "Carmen": "Carmen is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Carmen lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Caroline": "Caroline is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Caroline lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Carrie": "Carrie is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Carrie lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Cashmere": "Cashmere is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Cashmere lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Celeste": "Celeste is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Celeste lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Celia": "Celia is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Celia lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Celica": "Celica is a character from the Fire Emblem series. As part of the tactical RPG franchise, Celica may be a warrior, mage, or leader who participates in strategic battles and complex storylines involving kingdoms, dragons, and legendary weapons. Fire Emblem is renowned for its deep character development and permanent death mechanics.",
  "Cephalobot": "Cephalobot is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Cephalobot lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Cesar": "Cesar is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Cesar lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Chabwick": "Chabwick is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Chabwick lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Chadder": "Chadder is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Chadder lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Chai": "Chai is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Chai lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Charizard": "Charizard is a character from Pokemon. As part of this gaming franchise, Charizard contributes to the unique world and gameplay that Pokemon offers to players.",
  "Charlise": "Charlise is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Charlise lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Chelsea": "Chelsea is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Chelsea lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Cheri": "Cheri is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Cheri lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Cherry": "Cherry is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Cherry lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Chester": "Chester is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Chester lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Chevre": "Chevre is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Chevre lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Chibi-Robo": "Chibi-Robo is a character from Chibi Robo. As part of this gaming franchise, Chibi-Robo contributes to the unique world and gameplay that Chibi Robo offers to players.",
  "Chief": "Chief is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Chief lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Chip": "Chip is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Chip lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Chops": "Chops is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Chops lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Chow": "Chow is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Chow lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Chrissy": "Chrissy is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Chrissy lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Chrom": "Chrom is the prince of the Halidom of Ylisse and the main protagonist of Fire Emblem Awakening. Leading the Shepherds with his legendary blade Falchion, Chrom fights to protect his kingdom and prevent an apocalyptic future. His strong sense of justice and leadership make him a natural-born leader.",
  "Chun-Li": "Chun-Li is a fighter from the Street Fighter series. As one of the world warriors, Chun-Li competes in global tournaments testing martial arts mastery. Street Fighter pioneered competitive fighting games with its diverse cast and deep combat mechanics.",
  "Claude": "Claude is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Claude lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Claudia": "Claudia is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Claudia lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Clay": "Clay is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Clay lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Cleo": "Cleo is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Cleo lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Cloud Strife": "Cloud Strife is a character from the Final Fantasy series. As part of this legendary RPG franchise, Cloud Strife exists in a world of crystals, magic, summons, and epic stories. Final Fantasy is renowned for its cinematic storytelling and memorable characters.",
  "Clyde": "Clyde is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Clyde lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Coach": "Coach is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Coach lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Cobb": "Cobb is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Cobb lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Coco": "Coco is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Coco lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Cole": "Cole is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Cole lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Colton": "Colton is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Colton lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Cookie": "Cookie is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Cookie lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Copper": "Copper is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Copper lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Corrin": "Corrin is the customizable protagonist of Fire Emblem Fates, born to both the Hoshido and Nohr royal families. Blessed with the power to transform into a dragon, Corrin must navigate complex political conflicts and make difficult choices that shape the fate of two kingdoms.",
  "Cousteau": "Cousteau is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Cousteau lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Cranston": "Cranston is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Cranston lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Croque": "Croque is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Croque lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Cube": "Cube is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Cube lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Curlos": "Curlos is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Curlos lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Curly": "Curly is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Curly lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Curt": "Curt is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Curt lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Cyd": "Cyd is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Cyd lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Cyrano": "Cyrano is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Cyrano lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Cyrus": "Cyrus is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Cyrus lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Daijobu": "Daijobu is a character from Power Pros. As part of this gaming franchise, Daijobu contributes to the unique world and gameplay that Power Pros offers to players.",
  "Daisy": "Princess Daisy is the spirited ruler of Sarasaland and a close friend of Princess Peach. Unlike the more refined Peach, Daisy is known for her tomboyish personality, competitive spirit, and energetic attitude. She frequently appears in Mario sports and party games, bringing enthusiasm and determination to every competition.",
  "Daisy Mae": "Daisy Mae is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Daisy Mae lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Dark Pit": "Dark Pit, also known as Pittoo, is Pit's darker counterpart created by the Mirror of Truth. Unlike Pit, Dark Pit values his independence and refuses to serve any god. Despite his rebellious attitude, Dark Pit often ends up fighting alongside his original counterpart for the greater good.",
  "Dark Samus": "Dark Samus is Samus Aran's dark doppelganger, born from the fusion of Metroid Prime and Samus's Phazon Suit. This malevolent entity possesses incredible Phazon-based powers and serves as Samus's most dangerous and persistent nemesis throughout the Metroid Prime trilogy.",
  "Daruk": "Daruk is a character from The Legend of Zelda series. As part of the rich world of Hyrule and beyond, Daruk plays a role in the epic adventures featuring Link, Zelda, and the battle against darkness. The Zelda series is known for its intricate lore and memorable characters.",
  "Dee Jay": "Dee Jay is a fighter from the Street Fighter series. As one of the world warriors, Dee Jay competes in global tournaments testing martial arts mastery. Street Fighter pioneered competitive fighting games with its diverse cast and deep combat mechanics.",
  "Deena": "Deena is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Deena lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Deirdre": "Deirdre is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Deirdre lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Del": "Del is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Del lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Deli": "Deli is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Deli lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Derwin": "Derwin is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Derwin lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Detective Pikachu": "Detective Pikachu is a character from Pokemon. As part of this gaming franchise, Detective Pikachu contributes to the unique world and gameplay that Pokemon offers to players.",
  "Dhalsim": "Dhalsim is a fighter from the Street Fighter series. As one of the world warriors, Dhalsim competes in global tournaments testing martial arts mastery. Street Fighter pioneered competitive fighting games with its diverse cast and deep combat mechanics.",
  "Diana": "Diana is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Diana lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Diddy Kong": "Diddy Kong is Donkey Kong's energetic nephew and sidekick. Recognizable by his red cap and shirt, Diddy is quick, agile, and armed with peanut popguns and a jetpack. He's proven himself as both a capable partner and a hero in his own adventures.",
  "Digby": "Digby is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Digby lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Diva": "Diva is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Diva lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Dizzy": "Dizzy is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Dizzy lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Dobie": "Dobie is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Dobie lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Doc": "Doc is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Doc lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Dom": "Dom is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Dom lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Don Resetti": "Don Resetti is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Don Resetti lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Donkey Kong": "Donkey Kong is the powerful leader of the Kong family and guardian of Donkey Kong Island's banana hoard. This mighty gorilla combines incredible strength with surprising agility. Originally appearing as the antagonist in the 1981 arcade game, DK has since become one of Nintendo's most beloved heroes, starring in his own platforming adventures.",
  "Dora": "Dora is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Dora lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Dotty": "Dotty is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Dotty lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Drago": "Drago is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Drago lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Drake": "Drake is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Drake lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Drift": "Drift is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Drift lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Duck Hunt": "The Duck Hunt duo consists of a hunting dog and duck from the classic NES light gun game Duck Hunt. Working together despite their game's antagonistic relationship, this pair uses various zapper-based attacks. They represent one of gaming's most recognizable and nostalgic experiences.",
  "E. Honda": "E. Honda is a fighter from the Street Fighter series. As one of the world warriors, E. Honda competes in global tournaments testing martial arts mastery. Street Fighter pioneered competitive fighting games with its diverse cast and deep combat mechanics.",
  "E.M.M.I.": "E.M.M.I. is a character from the Metroid series. Set in a sci-fi universe of space exploration, alien threats, and isolation, E.M.M.I. plays a role in the atmospheric adventures of bounty hunter Samus Aran. Metroid is known for its exploration-focused gameplay and dark atmosphere.",
  "Ed": "Ed is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Ed lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Egbert": "Egbert is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Egbert lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Elena": "Elena is a fighter from the Street Fighter series. As one of the world warriors, Elena competes in global tournaments testing martial arts mastery. Street Fighter pioneered competitive fighting games with its diverse cast and deep combat mechanics.",
  "Elise": "Elise is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Elise lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Ellie": "Ellie is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Ellie lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Elmer": "Elmer is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Elmer lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Eloise": "Eloise is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Eloise lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Elvis": "Elvis is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Elvis lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Ena": "Ena is from the Monster Hunter series. In this world, hunters track and battle massive creatures using an arsenal of weapons and strategies. Monster Hunter is celebrated for its challenging combat and emphasis on preparation and teamwork.",
  "Erik": "Erik is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Erik lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Eugene": "Eugene is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Eugene lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Eunice": "Eunice is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Eunice lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Faith": "Faith is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Faith lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Falco": "Falco is a character from the Star Fox series. As part of the Lylat System's cast, Falco may be a pilot, ally, or enemy in space combat adventures featuring the Star Fox team. The series is known for its rail shooter gameplay and memorable characters.",
  "Fang": "Fang is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Fang lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Fauna": "Fauna is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Fauna lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Felicity": "Felicity is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Felicity lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Filbert": "Filbert is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Filbert lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Flick": "Flick is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Flick lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Flip": "Flip is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Flip lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Flo": "Flo is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Flo lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Flora": "Flora is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Flora lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Flurry": "Flurry is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Flurry lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Fox": "Fox is a character from the Star Fox series. As part of the Lylat System's cast, Fox may be a pilot, ally, or enemy in space combat adventures featuring the Star Fox team. The series is known for its rail shooter gameplay and memorable characters.",
  "Francine": "Francine is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Francine lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Frank": "Frank is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Frank lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Franklin": "Franklin is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Franklin lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Freckles": "Freckles is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Freckles lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Frett": "Frett is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Frett lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Freya": "Freya is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Freya lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Friga": "Friga is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Friga lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Frita": "Frita is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Frita lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Frobert": "Frobert is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Frobert lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Frye": "Frye is associated with the Splatoon series. In the colorful, ink-based world of turf wars, Frye represents the fresh and vibrant culture of Inkopolis. Splatoon is celebrated for its unique ink-based gameplay mechanics and fashion-forward style.",
  "Fuchsia": "Fuchsia is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Fuchsia lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Gabi": "Gabi is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Gabi lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Gakuto Sōgetsu": "Gakuto Sōgetsu is from the Yu-Gi-Oh! franchise, the popular trading card game and anime series. Yu-Gi-Oh! features duelists summoning monsters and casting spells in strategic card battles.",
  "Gala": "Gala is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Gala lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Ganda": "Ganda is a character from Power Pros. As part of this gaming franchise, Ganda contributes to the unique world and gameplay that Power Pros offers to players.",
  "Ganon": "Ganon is a character from The Legend of Zelda series. As part of the rich world of Hyrule and beyond, Ganon plays a role in the epic adventures featuring Link, Zelda, and the battle against darkness. The Zelda series is known for its intricate lore and memorable characters.",
  "Gaston": "Gaston is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Gaston lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Gayle": "Gayle is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Gayle lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Genji": "Genji is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Genji lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Gigi": "Gigi is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Gigi lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Gladys": "Gladys is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Gladys lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Gloria": "Gloria is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Gloria lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Goldie": "Goldie is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Goldie lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Gonzo": "Gonzo is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Gonzo lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Goomba": "Goomba is a character from the Super Mario series. As part of the colorful Mushroom Kingdom, Goomba joins Mario and friends in adventures filled with platforming challenges, power-ups, and battles against Bowser's forces. The Mario universe is known for its cheerful atmosphere and creative gameplay.",
  "Goose": "Goose is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Goose lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Gracie": "Gracie is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Gracie lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Graham": "Graham is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Graham lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Grams": "Grams is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Grams lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Greninja": "Greninja is the Ninja Pokémon, a Water/Dark-type that evolves from Froakie. Known for its incredible speed and stealth, Greninja creates throwing stars from compressed water and can create illusions. Its unique design and popularity have made it one of the most iconic Pokémon from Generation VI.",
  "Greta": "Greta is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Greta lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Grizzly": "Grizzly is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Grizzly lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Groucho": "Groucho is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Groucho lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Gruff": "Gruff is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Gruff lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Guardian": "Guardian is a character from The Legend of Zelda series. As part of the rich world of Hyrule and beyond, Guardian plays a role in the epic adventures featuring Link, Zelda, and the battle against darkness. The Zelda series is known for its intricate lore and memorable characters.",
  "Guile": "Guile is a fighter from the Street Fighter series. As one of the world warriors, Guile competes in global tournaments testing martial arts mastery. Street Fighter pioneered competitive fighting games with its diverse cast and deep combat mechanics.",
  "Gulliver": "Gulliver is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Gulliver lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Gwen": "Gwen is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Gwen lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Hamlet": "Hamlet is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Hamlet lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Hamphrey": "Hamphrey is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Hamphrey lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Hans": "Hans is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Hans lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Harriet": "Harriet is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Harriet lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Harry": "Harry is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Harry lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Harvey": "Harvey is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Harvey lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Hayakawa": "Hayakawa is a character from Power Pros. As part of this gaming franchise, Hayakawa contributes to the unique world and gameplay that Power Pros offers to players.",
  "Hazel": "Hazel is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Hazel lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Henry": "Henry is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Henry lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Hero": "The Hero represents the brave warriors from the Dragon Quest series, specifically the protagonists of Dragon Quest XI, III, IV, and VIII. Wielding swords and magic, these legendary heroes embark on quests to defeat evil and save their worlds. Dragon Quest's Heroes embody classic JRPG adventuring.",
  "Hippeux": "Hippeux is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Hippeux lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Hopkins": "Hopkins is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Hopkins lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Hopper": "Hopper is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Hopper lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Hornsby": "Hornsby is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Hornsby lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Huck": "Huck is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Huck lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Hugh": "Hugh is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Hugh lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Ice Climbers": "Ice Climbers is a character from Classic Nintendo. As part of this gaming franchise, Ice Climbers contributes to the unique world and gameplay that Classic Nintendo offers to players.",
  "Iggly": "Iggly is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Iggly lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Ikari": "Ikari is a character from Power Pros. As part of this gaming franchise, Ikari contributes to the unique world and gameplay that Power Pros offers to players.",
  "Ike": "Ike is the hero of the Tellius games in the Fire Emblem series. Starting as a mercenary and rising to become a legendary warrior, Ike wields the two-handed sword Ragnell with incredible strength. His 'I fight for my friends' determination and powerful attacks have made him a fan favorite.",
  "Incineroar": "Incineroar is the Heel Pokémon, a Fire/Dark-type that evolves from Litten. This wrestling-themed Pokémon loves to showboat and intimidate opponents with its powerful flame-based attacks. Incineroar's theatrical personality and devastating moves make it a crowd favorite.",
  "Ingrid": "Ingrid is a fighter from the Street Fighter series. As one of the world warriors, Ingrid competes in global tournaments testing martial arts mastery. Street Fighter pioneered competitive fighting games with its diverse cast and deep combat mechanics.",
  "Inkling": "Inklings are the squid-kid protagonists of the Splatoon series. These fashionable fighters can transform between humanoid and squid forms, using various ink-based weapons in turf wars. Inklings represent youth culture, creativity, and the competitive spirit of Splatoon's colorful ink battles.",
  "Ione": "Ione is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Ione lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Isabelle": "Isabelle is the cheerful, hardworking secretary from Animal Crossing. This dedicated Shih Tzu assists the player in managing their town, from public works projects to town ordinances. Despite her sweet demeanor and love of bells and fishing, Isabelle proves to be a surprisingly capable fighter in Super Smash Bros.",
  "Ivysaur": "Ivysaur is a character from Pokemon. As part of this gaming franchise, Ivysaur contributes to the unique world and gameplay that Pokemon offers to players.",
  "JP": "JP is a fighter from the Street Fighter series. As one of the world warriors, JP competes in global tournaments testing martial arts mastery. Street Fighter pioneered competitive fighting games with its diverse cast and deep combat mechanics.",
  "Jack": "Jack is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Jack lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Jacob": "Jacob is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Jacob lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Jacques": "Jacques is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Jacques lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Jambette": "Jambette is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Jambette lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Jamie": "Jamie is a fighter from the Street Fighter series. As one of the world warriors, Jamie competes in global tournaments testing martial arts mastery. Street Fighter pioneered competitive fighting games with its diverse cast and deep combat mechanics.",
  "Jay": "Jay is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Jay lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Jeremiah": "Jeremiah is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Jeremiah lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Jigglypuff": "Jigglypuff is the Balloon Pokémon known for its soothing singing voice that puts listeners to sleep. This Normal/Fairy-type Pokémon becomes upset when its audience falls asleep and draws on their faces with its marker. Jigglypuff's adorable appearance and unique fighting style have made it a Smash Bros. staple.",
  "Jingle": "Jingle is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Jingle lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Jitters": "Jitters is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Jitters lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Joan": "Joan is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Joan lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Joey": "Joey is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Joey lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Joker": "Joker is the codename of Ren Amamiya, the protagonist of Persona 5. As the leader of the Phantom Thieves, Joker infiltrates the Metaverse to steal corrupt hearts and change society. His stylish combat with Personas and his rebellious spirit have made him a modern JRPG icon.",
  "Judy": "Judy is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Judy lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Julia": "Julia is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Julia lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Julian": "Julian is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Julian lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "June": "June is a villager from the Animal Crossing series. As part of the diverse community of animal friends, June lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Juri": "Juri is a fighter from the Street Fighter series. As one of the world warriors, Juri competes in global tournaments testing martial arts mastery. Street Fighter pioneered competitive fighting games with its diverse cast and deep combat mechanics.",
  "K.K. Slider": "K.K. Slider is a villager from the Animal Crossing series. As part of the diverse community of animal friends, K.K. Slider lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Kabuki": "Kabuki is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Kabuki lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Kapp'n": "Kapp'n is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Kapp'n lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Katie": "Katie is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Katie lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Katrina": "Katrina is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Katrina lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Katt": "Katt is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Katt lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Kazuya": "Kazuya is from Tekken, the 3D fighting game series known for its juggle combos and family drama. Tekken features diverse martial arts styles and has been a fighting game staple for decades.",
  "Keaton": "Keaton is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Keaton lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Ken": "Ken Masters is Ryu's best friend and rival in the Street Fighter series. With his signature red gi and fiery Shoryuken, Ken brings a more aggressive and flashy style compared to Ryu. As a wealthy American martial artist, Ken balances his fighting prowess with family life.",
  "Ketchup": "Ketchup is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Ketchup lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Kevin": "Kevin is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Kevin lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Kicks": "Kicks is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Kicks lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Kid Cat": "Kid Cat is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Kid Cat lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Kidd": "Kidd is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Kidd lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Kiki": "Kiki is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Kiki lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Kimberly": "Kimberly is a fighter from the Street Fighter series. As one of the world warriors, Kimberly competes in global tournaments testing martial arts mastery. Street Fighter pioneered competitive fighting games with its diverse cast and deep combat mechanics.",
  "King Dedede": "King Dedede is the self-proclaimed king of Dream Land. While often portrayed as Kirby's rival or antagonist, Dedede isn't truly evil—he's pompous, greedy, and loves food, but occasionally helps Kirby save Dream Land. Armed with his trusty hammer and ability to inhale like Kirby, he's both a formidable opponent and reluctant ally.",
  "King K. Rool": "King K. Rool is the ruthless leader of the Kremlings and Donkey Kong's arch-nemesis. This crocodile tyrant constantly schemes to steal the Kong's banana hoard and take over Donkey Kong Island. His various disguises and persistent villainy have made him a memorable antagonist.",
  "King Knight": "King Knight is from Shovel Knight, the indie darling that combines retro aesthetics with modern game design. Shovel Knight features tight platforming, memorable music, and creative boss battles.",
  "Kirby": "Kirby is the adorable pink puffball from Planet Popstar. Despite his cute appearance, Kirby is a powerful hero who can inhale enemies and copy their abilities. With an insatiable appetite and boundless courage, Kirby has protected Dream Land from countless threats, from King Dedede to Dark Matter.",
  "Kitt": "Kitt is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Kitt lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Kitty": "Kitty is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Kitty lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Klaus": "Klaus is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Klaus lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Knox": "Knox is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Knox lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Kody": "Kody is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Kody lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Koopa Troopa": "Koopa Troopa is a character from the Super Mario series. As part of the colorful Mushroom Kingdom, Koopa Troopa joins Mario and friends in adventures filled with platforming challenges, power-ups, and battles against Bowser's forces. The Mario universe is known for its cheerful atmosphere and creative gameplay.",
  "Kyle": "Kyle is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Kyle lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Label": "Label is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Label lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Leif": "Leif is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Leif lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Leila": "Leila is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Leila lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Leilani": "Leilani is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Leilani lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Leonardo": "Leonardo is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Leonardo lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Leopold": "Leopold is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Leopold lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Lily": "Lily is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Lily lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Limberg": "Limberg is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Limberg lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Link": "Link is the courageous hero of The Legend of Zelda series. Wielding the Master Sword and carrying the Hylian Shield, Link embarks on epic quests to rescue Princess Zelda and defeat the dark lord Ganon. Though often silent, his bravery and determination have made him one of gaming's most beloved heroes across multiple timelines and incarnations.",
  "Lionel": "Lionel is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Lionel lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Little Mac": "Little Mac is the underdog boxer from the Punch-Out!! series. Training under Doc Louis and surviving on determination and heart, Little Mac fights his way through the ranks of the World Video Boxing Association. His lightning-fast ground game in Smash Bros. reflects his boxing prowess.",
  "Lobo": "Lobo is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Lobo lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Lolly": "Lolly is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Lolly lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Loot Goblin": "Loot Goblin is a character from Diablo. As part of this gaming franchise, Loot Goblin contributes to the unique world and gameplay that Diablo offers to players.",
  "Lopez": "Lopez is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Lopez lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Lottie": "Lottie is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Lottie lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Louie": "Louie is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Louie lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Lucario": "Lucario is a Fighting/Psychic-type Pokémon known for its ability to sense and manipulate Aura. This bipedal canine Pokémon can read others' thoughts and emotions through Aura waves. Lucario's signature move, Aura Sphere, and its Mega Evolution make it a formidable fighter in both Pokémon battles and Super Smash Bros.",
  "Lucas": "Lucas is a character from Earthbound. As part of this gaming franchise, Lucas contributes to the unique world and gameplay that Earthbound offers to players.",
  "Lucha": "Lucha is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Lucha lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Lucina": "Lucina is the daughter of Chrom from Fire Emblem Awakening. Traveling back in time to prevent a catastrophic future, Lucina initially disguises herself as the legendary Hero-King Marth. Wielding Falchion with skill and determination, she fights to save both her father and the world.",
  "Lucky": "Lucky is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Lucky lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Lucy": "Lucy is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Lucy lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Luigi": "Luigi is Mario's younger twin brother and the iconic hero in green. Often living in his brother's shadow, Luigi has proven himself as a brave adventurer in his own right, especially in the Luigi's Mansion series where he hunts ghosts with his trusty Poltergust vacuum. Despite his nervous disposition, Luigi's loyalty and courage shine through when it matters most.",
  "Luke": "Luke is a fighter from the Street Fighter series. As one of the world warriors, Luke competes in global tournaments testing martial arts mastery. Street Fighter pioneered competitive fighting games with its diverse cast and deep combat mechanics.",
  "Luna": "Luna is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Luna lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Lyle": "Lyle is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Lyle lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Lyman": "Lyman is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Lyman lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "M. Bison": "M. Bison is a fighter from the Street Fighter series. As one of the world warriors, M. Bison competes in global tournaments testing martial arts mastery. Street Fighter pioneered competitive fighting games with its diverse cast and deep combat mechanics.",
  "Mabel": "Mabel is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Mabel lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Mac": "Mac is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Mac lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Maddie": "Maddie is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Maddie lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Maelle": "Maelle is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Maelle lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Maggie": "Maggie is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Maggie lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Magnamalo": "Magnamalo is from the Monster Hunter series. In this world, hunters track and battle massive creatures using an arsenal of weapons and strategies. Monster Hunter is celebrated for its challenging combat and emphasis on preparation and teamwork.",
  "Mai": "Mai is a character from Fatal Fury. As part of this gaming franchise, Mai contributes to the unique world and gameplay that Fatal Fury offers to players.",
  "Mallary": "Mallary is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Mallary lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Malzeno": "Malzeno is from the Monster Hunter series. In this world, hunters track and battle massive creatures using an arsenal of weapons and strategies. Monster Hunter is celebrated for its challenging combat and emphasis on preparation and teamwork.",
  "Manon": "Manon is a fighter from the Street Fighter series. As one of the world warriors, Manon competes in global tournaments testing martial arts mastery. Street Fighter pioneered competitive fighting games with its diverse cast and deep combat mechanics.",
  "Maple": "Maple is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Maple lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Marcel": "Marcel is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Marcel lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Marcie": "Marcie is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Marcie lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Margie": "Margie is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Margie lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Marie": "Marie is associated with the Splatoon series. In the colorful, ink-based world of turf wars, Marie represents the fresh and vibrant culture of Inkopolis. Splatoon is celebrated for its unique ink-based gameplay mechanics and fashion-forward style.",
  "Marina": "Marina is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Marina lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Mario": "Mario is Nintendo's iconic mascot and one of the most recognizable video game characters worldwide. The cheerful plumber from the Mushroom Kingdom has been saving Princess Peach from Bowser since 1985. Known for his red cap, blue overalls, and legendary jumping ability, Mario has starred in countless platformers, racing games, sports titles, and party games.",
  "Mario Cereal": "Mario Cereal is a character from Kellogs. As part of this gaming franchise, Mario Cereal contributes to the unique world and gameplay that Kellogs offers to players.",
  "Marisa": "Marisa is a fighter from the Street Fighter series. As one of the world warriors, Marisa competes in global tournaments testing martial arts mastery. Street Fighter pioneered competitive fighting games with its diverse cast and deep combat mechanics.",
  "Marlo": "Marlo is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Marlo lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Marshal": "Marshal is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Marshal lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Marth": "Marth is the prince of Altea and the protagonist of the first Fire Emblem game. Wielding the legendary Falchion sword, Marth leads an army to reclaim his kingdom and save the continent. His inclusion in Super Smash Bros. Melee introduced Western audiences to the Fire Emblem series.",
  "Marty": "Marty is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Marty lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Mathilda": "Mathilda is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Mathilda lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Mega Man": "Mega Man is the heroic robot created by Dr. Light to fight the evil Dr. Wily. Originally known as Rock, he was transformed into a fighting robot with the ability to copy defeated Robot Masters' weapons. Mega Man's iconic Mega Buster and determination to protect humanity have made him a legendary gaming icon since 1987.",
  "Megan": "Megan is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Megan lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Melba": "Melba is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Melba lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Merengue": "Merengue is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Merengue lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Merry": "Merry is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Merry lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Meta Knight": "Meta Knight is the mysterious masked swordsman from the Kirby series. Commanding the airship Halberd and wielding the legendary sword Galaxia, Meta Knight is both Kirby's rival and occasional ally. His honorable warrior code and incredible swordsmanship make him one of Dream Land's most formidable fighters.",
  "Metal Mario": "Metal Mario is a playable character in Mario Sports Superstars. Competing in various sports including soccer, baseball, tennis, golf, and horse racing, Metal Mario brings their unique skills to the competitive world of Mario sports. The game celebrates athletic competition in the Mushroom Kingdom.",
  "Metroid": "Metroid is a character from the Metroid series. Set in a sci-fi universe of space exploration, alien threats, and isolation, Metroid plays a role in the atmospheric adventures of bounty hunter Samus Aran. Metroid is known for its exploration-focused gameplay and dark atmosphere.",
  "Mewtwo": "Mewtwo is a character from Pokemon. As part of this gaming franchise, Mewtwo contributes to the unique world and gameplay that Pokemon offers to players.",
  "Midge": "Midge is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Midge lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Midna": "Midna is a character from The Legend of Zelda series. As part of the rich world of Hyrule and beyond, Midna plays a role in the epic adventures featuring Link, Zelda, and the battle against darkness. The Zelda series is known for its intricate lore and memorable characters.",
  "Mii": "Mii is a character from Mii. As part of this gaming franchise, Mii contributes to the unique world and gameplay that Mii offers to players.",
  "Min Min": "Min Min is a fighter from ARMS, known for her extendable spring-loaded arms and love of ramen. Representing the Mintendo Noodle House, Min Min uses her signature dragon arm laser and kicking abilities to defeat opponents. Her victory in the Party Crash Bash tournament cemented her as an ARMS icon.",
  "Mint": "Mint is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Mint lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Mio": "Mio is a character from Xenoblade. As part of this gaming franchise, Mio contributes to the unique world and gameplay that Xenoblade offers to players.",
  "Mipha": "Mipha is a character from The Legend of Zelda series. As part of the rich world of Hyrule and beyond, Mipha plays a role in the epic adventures featuring Link, Zelda, and the battle against darkness. The Zelda series is known for its intricate lore and memorable characters.",
  "Mira": "Mira is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Mira lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Miranda": "Miranda is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Miranda lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Mitzi": "Mitzi is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Mitzi lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Moe": "Moe is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Moe lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Molly": "Molly is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Molly lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Monique": "Monique is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Monique lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Monty": "Monty is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Monty lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Moose": "Moose is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Moose lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Mott": "Mott is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Mott lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Mr. G&W": "Mr. G&W is a character from Classic Nintendo. As part of this gaming franchise, Mr. G&W contributes to the unique world and gameplay that Classic Nintendo offers to players.",
  "Muffy": "Muffy is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Muffy lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Murphy": "Murphy is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Murphy lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Mythra": "Mythra is Pyra's alternate form and the original personality of the Aegis in Xenoblade Chronicles 2. More confident and aggressive than Pyra, Mythra wields devastating light-based powers. Her complicated past and fierce combat abilities make her a complex and powerful character.",
  "Nabiru": "Nabiru is from the Monster Hunter series. In this world, hunters track and battle massive creatures using an arsenal of weapons and strategies. Monster Hunter is celebrated for its challenging combat and emphasis on preparation and teamwork.",
  "Nail Saionji": "Nail Saionji is from the Yu-Gi-Oh! franchise, the popular trading card game and anime series. Yu-Gi-Oh! features duelists summoning monsters and casting spells in strategic card battles.",
  "Nan": "Nan is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Nan lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Nana": "Nana is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Nana lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Naomi": "Naomi is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Naomi lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Nat": "Nat is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Nat lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Nate": "Nate is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Nate lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Ness": "Ness is the young psychic hero from EarthBound (Mother 2). Armed with psychic PSI powers and his trusty baseball bat, Ness embarks on a quest to save the world from the alien force Giygas. His courage and determination despite his young age have made him a beloved cult classic character.",
  "Nibbles": "Nibbles is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Nibbles lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Niko": "Niko is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Niko lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Noah": "Noah is a character from Xenoblade. As part of this gaming franchise, Noah contributes to the unique world and gameplay that Xenoblade offers to players.",
  "Norma": "Norma is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Norma lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "OHare": "OHare is a villager from the Animal Crossing series. As part of the diverse community of animal friends, OHare lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Octavian": "Octavian is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Octavian lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Octoling": "Octoling is associated with the Splatoon series. In the colorful, ink-based world of turf wars, Octoling represents the fresh and vibrant culture of Inkopolis. Splatoon is celebrated for its unique ink-based gameplay mechanics and fashion-forward style.",
  "Olaf": "Olaf is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Olaf lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Olimar": "Captain Olimar is the protagonist of the Pikmin series, a space explorer from the planet Hocotate. Stranded on an unknown planet, Olimar commands colorful plant-like Pikmin to gather ship parts and survive. Despite his small stature, Olimar's leadership and strategic thinking make him a capable survivor.",
  "Olive": "Olive is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Olive lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Olivia": "Olivia is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Olivia lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "One-Eyed Rathalos": "One-Eyed Rathalos is from the Monster Hunter series. In this world, hunters track and battle massive creatures using an arsenal of weapons and strategies. Monster Hunter is celebrated for its challenging combat and emphasis on preparation and teamwork.",
  "Opal": "Opal is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Opal lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Orville": "Orville is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Orville lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Ozzie": "Ozzie is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Ozzie lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "PAC-MAN": "PAC-MAN is a character from Pac-man. As part of this gaming franchise, PAC-MAN contributes to the unique world and gameplay that Pac-man offers to players.",
  "Palamute": "Palamute is from the Monster Hunter series. In this world, hunters track and battle massive creatures using an arsenal of weapons and strategies. Monster Hunter is celebrated for its challenging combat and emphasis on preparation and teamwork.",
  "Palico": "Palico is from the Monster Hunter series. In this world, hunters track and battle massive creatures using an arsenal of weapons and strategies. Monster Hunter is celebrated for its challenging combat and emphasis on preparation and teamwork.",
  "Palutena": "Palutena is the Goddess of Light and ruler of Skyworld. Guiding Pit with her wisdom and divine powers, Palutena works to protect humanity from various threats. Her playful yet powerful personality shines through in Kid Icarus: Uprising.",
  "Pancetti": "Pancetti is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Pancetti lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Pango": "Pango is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Pango lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Paolo": "Paolo is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Paolo lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Papi": "Papi is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Papi lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Pascal": "Pascal is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Pascal lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Pashmina": "Pashmina is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Pashmina lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Pate": "Pate is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Pate lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Patty": "Patty is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Patty lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Paula": "Paula is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Paula lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Pave": "Pave is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Pave lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Pawapuro": "Pawapuro is a character from Power Pros. As part of this gaming franchise, Pawapuro contributes to the unique world and gameplay that Power Pros offers to players.",
  "Peach": "Princess Peach is the beloved ruler of the Mushroom Kingdom, known for her grace, kindness, and surprising resilience. While often portrayed as a damsel in distress, Peach has demonstrated her own heroic capabilities in games like Super Princess Peach and as a playable character in various Mario adventures.",
  "Peaches": "Peaches is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Peaches lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Peanut": "Peanut is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Peanut lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Pearl": "Pearl is associated with the Splatoon series. In the colorful, ink-based world of turf wars, Pearl represents the fresh and vibrant culture of Inkopolis. Splatoon is celebrated for its unique ink-based gameplay mechanics and fashion-forward style.",
  "Pecan": "Pecan is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Pecan lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Peck": "Peck is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Peck lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Peewee": "Peewee is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Peewee lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Peggy": "Peggy is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Peggy lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Pekoe": "Pekoe is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Pekoe lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Pelly": "Pelly is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Pelly lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Penelope": "Penelope is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Penelope lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Pete": "Pete is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Pete lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Petri": "Petri is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Petri lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Phil": "Phil is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Phil lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Phineas": "Phineas is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Phineas lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Phoebe": "Phoebe is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Phoebe lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Phyllis": "Phyllis is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Phyllis lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Pichu": "Pichu is a character from Pokemon. As part of this gaming franchise, Pichu contributes to the unique world and gameplay that Pokemon offers to players.",
  "Pierce": "Pierce is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Pierce lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Pietro": "Pietro is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Pietro lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Pikachu": "Pikachu is the most famous Pokémon and the franchise's mascot. This Electric-type mouse Pokémon is known for its lightning bolt-shaped tail, rosy cheeks, and signature 'Pika Pika!' cry. As Ash Ketchum's loyal partner in the anime, Pikachu has become a global icon representing the entire Pokémon universe.",
  "Pikmin": "Pikmin is from the Pikmin series, where players command plant-like creatures to solve puzzles and battle enemies. Pikmin combines strategy, exploration, and time management in a unique real-time tactics experience.",
  "Pink Gold Peach": "Pink Gold Peach is a playable character in Mario Sports Superstars. Competing in various sports including soccer, baseball, tennis, golf, and horse racing, Pink Gold Peach brings their unique skills to the competitive world of Mario sports. The game celebrates athletic competition in the Mushroom Kingdom.",
  "Pinky": "Pinky is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Pinky lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Piper": "Piper is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Piper lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Pippy": "Pippy is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Pippy lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Piranha Plant": "Piranha Plant is a character from the Super Mario series. As part of the colorful Mushroom Kingdom, Piranha Plant joins Mario and friends in adventures filled with platforming challenges, power-ups, and battles against Bowser's forces. The Mario universe is known for its cheerful atmosphere and creative gameplay.",
  "Pit": "Pit is the angel of Skyworld and servant of the goddess Palutena. Armed with the Bow of Palutena and the Power of Flight, Pit battles the forces of the Underworld Army. His optimistic personality and heroic deeds in Kid Icarus: Uprising revitalized the classic franchise.",
  "Plague Knight": "Plague Knight is from Shovel Knight, the indie darling that combines retro aesthetics with modern game design. Shovel Knight features tight platforming, memorable music, and creative boss battles.",
  "Plucky": "Plucky is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Plucky lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Pokemon Trainer": "Pokemon Trainer is a character from Pokemon. As part of this gaming franchise, Pokemon Trainer contributes to the unique world and gameplay that Pokemon offers to players.",
  "Pompom": "Pompom is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Pompom lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Poncho": "Poncho is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Poncho lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Poochy": "Poochy is a character from Yoshi's Woolly World. As part of this gaming franchise, Poochy contributes to the unique world and gameplay that Yoshi's Woolly World offers to players.",
  "Poppy": "Poppy is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Poppy lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Porter": "Porter is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Porter lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Portia": "Portia is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Portia lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Prince": "Prince is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Prince lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Puck": "Puck is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Puck lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Puddles": "Puddles is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Puddles lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Pudge": "Pudge is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Pudge lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Punchy": "Punchy is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Punchy lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Purrl": "Purrl is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Purrl lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Pyra": "Pyra is a legendary Blade and one of the main protagonists of Xenoblade Chronicles 2. As the Aegis, she wields immense fire-based powers and partners with the Driver Rex on an epic journey to Elysium. Her kind heart and powerful abilities make her both a compassionate ally and formidable warrior.",
  "Qbby": "Qbby is a character from BoxBoy!. As part of this gaming franchise, Qbby contributes to the unique world and gameplay that BoxBoy! offers to players.",
  "Queenie": "Queenie is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Queenie lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Quillson": "Quillson is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Quillson lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Quinn": "Quinn is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Quinn lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Qurupeco": "Qurupeco is from the Monster Hunter series. In this world, hunters track and battle massive creatures using an arsenal of weapons and strategies. Monster Hunter is celebrated for its challenging combat and emphasis on preparation and teamwork.",
  "R.O.B.": "R.O.B. (Robotic Operating Buddy) is Nintendo's toy robot accessory from 1985 that worked with NES games. This gyromite and stack-up playing robot became a playable fighter, representing Nintendo's innovative history. R.O.B.'s transformation from peripheral to character showcases Nintendo's creativity.",
  "Raddle": "Raddle is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Raddle lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Rasher": "Rasher is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Rasher lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Rashid": "Rashid is a fighter from the Street Fighter series. As one of the world warriors, Rashid competes in global tournaments testing martial arts mastery. Street Fighter pioneered competitive fighting games with its diverse cast and deep combat mechanics.",
  "Rathian": "Rathian is from the Monster Hunter series. In this world, hunters track and battle massive creatures using an arsenal of weapons and strategies. Monster Hunter is celebrated for its challenging combat and emphasis on preparation and teamwork.",
  "Raymond": "Raymond is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Raymond lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Razewing Ratha": "Razewing Ratha is from the Monster Hunter series. In this world, hunters track and battle massive creatures using an arsenal of weapons and strategies. Monster Hunter is celebrated for its challenging combat and emphasis on preparation and teamwork.",
  "Redd": "Redd is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Redd lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Reese": "Reese is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Reese lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Reneigh": "Reneigh is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Reneigh lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Renée": "Renée is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Renée lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Resetti": "Resetti is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Resetti lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Revali": "Revali is a character from The Legend of Zelda series. As part of the rich world of Hyrule and beyond, Revali plays a role in the epic adventures featuring Link, Zelda, and the battle against darkness. The Zelda series is known for its intricate lore and memorable characters.",
  "Rex": "Rex is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Rex lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Rhonda": "Rhonda is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Rhonda lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Ribbot": "Ribbot is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Ribbot lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Richter": "Richter Belmont is a legendary vampire hunter from the Castlevania series. Wielding the Vampire Killer whip and holy weapons, Richter battles Dracula and his forces of darkness. His role in Castlevania: Rondo of Blood and Symphony of the Night cemented him as one of the franchise's greatest heroes.",
  "Ricky": "Ricky is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Ricky lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Ridley": "Ridley is the cunning and ruthless leader of the Space Pirates and Samus Aran's arch-nemesis. This pterodactyl-like alien destroyed Samus's home and killed her parents, making him one of gaming's most personal villains. Ridley's intelligence, ferocity, and ability to regenerate make him a terrifying recurring threat in the Metroid series.",
  "Riju": "Riju is a character from The Legend of Zelda series. As part of the rich world of Hyrule and beyond, Riju plays a role in the epic adventures featuring Link, Zelda, and the battle against darkness. The Zelda series is known for its intricate lore and memorable characters.",
  "Rilla": "Rilla is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Rilla lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Rio": "Rio is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Rio lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Rizzo": "Rizzo is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Rizzo lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Roa Kirishima": "Roa Kirishima is from the Yu-Gi-Oh! franchise, the popular trading card game and anime series. Yu-Gi-Oh! features duelists summoning monsters and casting spells in strategic card battles.",
  "Roald": "Roald is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Roald lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Robin": "Robin is the customizable tactician from Fire Emblem Awakening. Gifted with strategic brilliance and magical prowess, Robin serves as Chrom's trusted advisor and the player's avatar. Robin's ability to wield both magic and swords makes them a versatile and formidable warrior.",
  "Rocco": "Rocco is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Rocco lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Rocket": "Rocket is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Rocket lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Rod": "Rod is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Rod lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Rodeo": "Rodeo is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Rodeo lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Rodney": "Rodney is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Rodney lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Rolf": "Rolf is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Rolf lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Romin Kirishima": "Romin Kirishima is from the Yu-Gi-Oh! franchise, the popular trading card game and anime series. Yu-Gi-Oh! features duelists summoning monsters and casting spells in strategic card battles.",
  "Rooney": "Rooney is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Rooney lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Rory": "Rory is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Rory lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Rosalina": "Rosalina is the mysterious guardian of the cosmos who watches over the Lumas in the Comet Observatory. Making her debut in Super Mario Galaxy, Rosalina possesses magical powers and a deep connection to the stars. Her serene yet powerful presence has made her a beloved addition to the Mario universe.",
  "Roscoe": "Roscoe is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Roscoe lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Rosie": "Rosie is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Rosie lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Roswell": "Roswell is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Roswell lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Rover": "Rover is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Rover lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Rowan": "Rowan is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Rowan lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Roy": "Roy is the young lion of Pherae and protagonist of Fire Emblem: The Binding Blade. Despite his youth, Roy leads an army with the Sword of Seals to save the continent of Elibe. His debut in Super Smash Bros. Melee actually preceded his own game's release in Japan.",
  "Ruby": "Ruby is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Ruby lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Rudy": "Rudy is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Rudy lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Ryu": "Ryu is the iconic world warrior and protagonist of the Street Fighter series. Dedicated to perfecting his martial arts through constant training and battle, Ryu seeks to master the Hadoken, Shoryuken, and Tatsumaki Senpukyaku. His journey to become a true martial artist has made him a fighting game legend.",
  "Sable": "Sable is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Sable lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Sagat": "Sagat is a fighter from the Street Fighter series. As one of the world warriors, Sagat competes in global tournaments testing martial arts mastery. Street Fighter pioneered competitive fighting games with its diverse cast and deep combat mechanics.",
  "Saharah": "Saharah is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Saharah lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Sally": "Sally is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Sally lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Samson": "Samson is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Samson lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Samus": "Samus is a character from the Metroid series. Set in a sci-fi universe of space exploration, alien threats, and isolation, Samus plays a role in the atmospheric adventures of bounty hunter Samus Aran. Metroid is known for its exploration-focused gameplay and dark atmosphere.",
  "Sandy": "Sandy is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Sandy lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Sasha": "Sasha is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Sasha lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Savannah": "Savannah is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Savannah lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Scoot": "Scoot is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Scoot lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Sephiroth": "Sephiroth is one of gaming's most iconic villains, serving as the main antagonist of Final Fantasy VII. Wielding the impossibly long Masamune katana and possessing godlike powers, Sephiroth's tragic fall from hero to destroyer has captivated players for decades. His theme song 'One-Winged Angel' is instantly recognizable.",
  "Shadow Mewtwo": "Shadow Mewtwo is a character from Pokemon. As part of this gaming franchise, Shadow Mewtwo contributes to the unique world and gameplay that Pokemon offers to players.",
  "Shari": "Shari is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Shari lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Sheldon": "Sheldon is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Sheldon lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Shep": "Shep is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Shep lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Sherb": "Sherb is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Sherb lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Shino": "Shino is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Shino lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Shiver": "Shiver is associated with the Splatoon series. In the colorful, ink-based world of turf wars, Shiver represents the fresh and vibrant culture of Inkopolis. Splatoon is celebrated for its unique ink-based gameplay mechanics and fashion-forward style.",
  "Shovel Knight": "Shovel Knight is the indie gaming icon who wields the Shovel Blade. This knight of the Blue Order embarks on a quest to rescue his beloved Shield Knight and defeat the evil Enchantress. Combining classic 8-bit aesthetics with modern game design, Shovel Knight has become one of the most celebrated indie characters.",
  "Shrunk": "Shrunk is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Shrunk lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Shulk": "Shulk is the protagonist of Xenoblade Chronicles, wielding the legendary Monado blade. This weapon grants him visions of the future and the power to fight mechanical beings. Shulk's journey from engineer to hero, along with his ability to change the future, makes him a unique and compelling character.",
  "Sidon": "Sidon is a character from The Legend of Zelda series. As part of the rich world of Hyrule and beyond, Sidon plays a role in the epic adventures featuring Link, Zelda, and the battle against darkness. The Zelda series is known for its intricate lore and memorable characters.",
  "Simon": "Simon Belmont is one of the most famous vampire hunters in the Belmont lineage from Castlevania. Armed with the legendary Vampire Killer whip and an arsenal of holy weapons, Simon's quest to defeat Dracula in the original Castlevania established the series' gothic horror legacy.",
  "Skye": "Skye is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Skye lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Sly": "Sly is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Sly lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Smallfry": "Smallfry is associated with the Splatoon series. In the colorful, ink-based world of turf wars, Smallfry represents the fresh and vibrant culture of Inkopolis. Splatoon is celebrated for its unique ink-based gameplay mechanics and fashion-forward style.",
  "Snake": "Solid Snake is the legendary soldier and protagonist of the Metal Gear series. A master of stealth and infiltration, Snake undertakes dangerous missions to stop nuclear threats. His gruff voice, tactical genius, and codec calls have made him one of gaming's most iconic characters.",
  "Snooty": "Snooty is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Snooty lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Solaire of Astora": "Solaire of Astora is a character from Dark Souls. As part of this gaming franchise, Solaire of Astora contributes to the unique world and gameplay that Dark Souls offers to players.",
  "Soleil": "Soleil is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Soleil lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Sonic": "Sonic the Hedgehog is the blue blur and SEGA's mascot. Known for his incredible speed, red shoes, and attitude, Sonic races through zones collecting rings and stopping Dr. Eggman's evil schemes. His rivalry-turned-friendship with Mario represents one of gaming's greatest crossovers.",
  "Sora": "Sora is the cheerful and determined protagonist of the Kingdom Hearts series. Wielding the Keyblade and traveling across Disney and Final Fantasy worlds, Sora fights against darkness alongside Donald Duck and Goofy. His optimism and friendship have made him one of the most beloved characters in gaming.",
  "Sparro": "Sparro is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Sparro lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Specter Knight": "Specter Knight is from Shovel Knight, the indie darling that combines retro aesthetics with modern game design. Shovel Knight features tight platforming, memorable music, and creative boss battles.",
  "Spike": "Spike is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Spike lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Spork/Crackle": "Spork/Crackle is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Spork/Crackle lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Sprinkle": "Sprinkle is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Sprinkle lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Sprocket": "Sprocket is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Sprocket lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Squirtle": "Squirtle is a character from Pokemon. As part of this gaming franchise, Squirtle contributes to the unique world and gameplay that Pokemon offers to players.",
  "Static": "Static is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Static lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Stella": "Stella is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Stella lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Sterling": "Sterling is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Sterling lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Steve": "Steve is the default player character from Minecraft, the best-selling video game of all time. Armed with a pickaxe and the ability to mine, craft, and build anything imaginable, Steve represents the creativity and limitless potential of Minecraft's blocky world.",
  "Stinky": "Stinky is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Stinky lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Stitches": "Stitches is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Stitches lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Stu": "Stu is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Stu lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Sydney": "Sydney is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Sydney lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Sylux": "Sylux is a character from the Metroid series. Set in a sci-fi universe of space exploration, alien threats, and isolation, Sylux plays a role in the atmospheric adventures of bounty hunter Samus Aran. Metroid is known for its exploration-focused gameplay and dark atmosphere.",
  "Sylvana": "Sylvana is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Sylvana lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Sylvia": "Sylvia is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Sylvia lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "T-Bone": "T-Bone is a villager from the Animal Crossing series. As part of the diverse community of animal friends, T-Bone lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Tabby": "Tabby is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Tabby lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Tad": "Tad is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Tad lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Tammi": "Tammi is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Tammi lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Tammy": "Tammy is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Tammy lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Tangy": "Tangy is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Tangy lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Tank": "Tank is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Tank lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Tasha": "Tasha is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Tasha lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Tatsuhisa “Luke” Kamijō": "Tatsuhisa “Luke” Kamijō is from the Yu-Gi-Oh! franchise, the popular trading card game and anime series. Yu-Gi-Oh! features duelists summoning monsters and casting spells in strategic card battles.",
  "Teddy": "Teddy is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Teddy lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Terry": "Terry is a character from Fatal Fury. As part of this gaming franchise, Terry contributes to the unique world and gameplay that Fatal Fury offers to players.",
  "Tex": "Tex is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Tex lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Tia": "Tia is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Tia lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Tiansheng": "Tiansheng is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Tiansheng lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Tiffany": "Tiffany is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Tiffany lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Tiki": "Tiki is a character from the Fire Emblem series. As part of the tactical RPG franchise, Tiki may be a warrior, mage, or leader who participates in strategic battles and complex storylines involving kingdoms, dragons, and legendary weapons. Fire Emblem is renowned for its deep character development and permanent death mechanics.",
  "Timbra": "Timbra is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Timbra lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Timmy": "Timmy is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Timmy lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Timmy & Tommy": "Timmy & Tommy is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Timmy & Tommy lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Tipper": "Tipper is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Tipper lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Toad": "Toad is one of Princess Peach's most loyal attendants and a recurring character in the Mario series. Recognizable by his mushroom cap and cheerful demeanor, Toad has served as Mario's companion, guide, and even playable hero. Despite his small stature, Toad's courage and helpfulness have made him an endearing character.",
  "Toby": "Toby is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Toby lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Tom": "Tom is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Tom lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Tom Nook": "Tom Nook is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Tom Nook lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Tommy": "Tommy is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Tommy lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Tortimer": "Tortimer is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Tortimer lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Truffles": "Truffles is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Truffles lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Tsukino": "Tsukino is from the Monster Hunter series. In this world, hunters track and battle massive creatures using an arsenal of weapons and strategies. Monster Hunter is celebrated for its challenging combat and emphasis on preparation and teamwork.",
  "Tucker": "Tucker is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Tucker lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Tulin": "Tulin is a character from The Legend of Zelda series. As part of the rich world of Hyrule and beyond, Tulin plays a role in the epic adventures featuring Link, Zelda, and the battle against darkness. The Zelda series is known for its intricate lore and memorable characters.",
  "Tutu": "Tutu is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Tutu lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Twiggy": "Twiggy is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Twiggy lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Tybalt": "Tybalt is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Tybalt lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Urbosa": "Urbosa is a character from The Legend of Zelda series. As part of the rich world of Hyrule and beyond, Urbosa plays a role in the epic adventures featuring Link, Zelda, and the battle against darkness. The Zelda series is known for its intricate lore and memorable characters.",
  "Ursala": "Ursala is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Ursala lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Velma": "Velma is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Velma lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Vesta": "Vesta is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Vesta lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Vic": "Vic is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Vic lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Victoria": "Victoria is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Victoria lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Villager": "The Villager is the customizable protagonist of Animal Crossing. Moving to a new town with nothing but the clothes on their back, the Villager befriends animal neighbors, catches bugs and fish, decorates their home, and builds a peaceful community. Despite their cute appearance, the Villager is a surprisingly fierce fighter in Super Smash Bros.",
  "Violet": "Violet is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Violet lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Vivian": "Vivian is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Vivian lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Vladimir": "Vladimir is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Vladimir lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Waddle Dee": "Waddle Dee is a character from the Kirby series. As part of Dream Land's colorful cast, Waddle Dee appears in Kirby's adventures defending Pop Star from various threats. The Kirby series is beloved for its cute aesthetics, creative copy abilities, and surprisingly deep lore.",
  "Wade": "Wade is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Wade lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Walker": "Walker is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Walker lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Walt": "Walt is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Walt lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Waluigi": "Waluigi is Luigi's rival and Wario's partner in crime. Tall, lanky, and dressed in purple, Waluigi is known for his mischievous nature and love of causing trouble in Mario spin-off games. Despite never having his own game, Waluigi has cultivated a dedicated fanbase through his chaotic energy and memorable 'WAH!' cry.",
  "Wardell": "Wardell is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Wardell lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Wario": "Wario is Mario's greedy and mischievous rival. With his purple overalls, yellow cap, and signature zigzag mustache, Wario seeks treasure and wealth above all else. Despite his crude behavior, Wario has become an antihero in his own right, starring in the WarioWare series and proving that being bad can be very, very good.",
  "Wart Jr.": "Wart Jr. is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Wart Jr. lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Weber": "Weber is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Weber lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Wendell": "Wendell is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Wendell lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Wendy": "Wendy is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Wendy lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Whitney": "Whitney is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Whitney lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Wii Fit Trainer": "The Wii Fit Trainer is the coach from the Wii Fit series who guides players through yoga poses and exercises. Promoting health and fitness with encouraging advice, the Trainer uses exercise moves as attacks. Their inclusion in Smash Bros. represents Nintendo's innovative approach to gaming and wellness.",
  "Wilbur": "Wilbur is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Wilbur lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Willow": "Willow is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Willow lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Winnie": "Winnie is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Winnie lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Wisp": "Wisp is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Wisp lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Wolf": "Wolf O'Donnell is the leader of Star Wolf, Fox McCloud's rival mercenary team. Piloting the Wolfen and wielding his blaster, Wolf serves as a formidable antagonist and occasional reluctant ally in the Star Fox series. His tough attitude and combat prowess match Fox's own skills.",
  "Wolfgang": "Wolfgang is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Wolfgang lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Yabe": "Yabe is a character from Power Pros. As part of this gaming franchise, Yabe contributes to the unique world and gameplay that Power Pros offers to players.",
  "Yoshi": "Yoshi is Mario's loyal dinosaur companion and the hero of Yoshi's Island. Known for his long tongue, ability to eat nearly anything, and signature ground pound, Yoshi comes in many colors. His cheerful nature and willingness to help make him one of Mario's most trusted friends.",
  "Yuga Ohdo": "Yuga Ohdo is from the Yu-Gi-Oh! franchise, the popular trading card game and anime series. Yu-Gi-Oh! features duelists summoning monsters and casting spells in strategic card battles.",
  "Yuka": "Yuka is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Yuka lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Yunobo": "Yunobo is a character from The Legend of Zelda series. As part of the rich world of Hyrule and beyond, Yunobo plays a role in the epic adventures featuring Link, Zelda, and the battle against darkness. The Zelda series is known for its intricate lore and memorable characters.",
  "Zangief": "Zangief is a fighter from the Street Fighter series. As one of the world warriors, Zangief competes in global tournaments testing martial arts mastery. Street Fighter pioneered competitive fighting games with its diverse cast and deep combat mechanics.",
  "Zelda": "Zelda is a character from The Legend of Zelda series. As part of the rich world of Hyrule and beyond, Zelda plays a role in the epic adventures featuring Link, Zelda, and the battle against darkness. The Zelda series is known for its intricate lore and memorable characters.",
  "Zell": "Zell is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Zell lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Zipper": "Zipper is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Zipper lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Zoe": "Zoe is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Zoe lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Zucker": "Zucker is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Zucker lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life.",
  "Étoile": "Étoile is a villager from the Animal Crossing series. As part of the diverse community of animal friends, Étoile lives a peaceful life in the village, participating in daily activities, festivals, and building friendships with neighbors. Each Animal Crossing villager brings their own unique personality and charm to island life."
}