{
  "8-Bit Link": "This 8-Bit Link amiibo pays homage to Link's classic 8-bit sprite from the original NES games. Part of the Legend Of Zelda series, this pixelated figure celebrates gaming's retro roots and the evolution of Link through gaming history.",
  "8-Bit Mario Classic Color": "This 8-Bit Mario Classic Color amiibo pays homage to Mario's classic 8-bit sprite from the original NES games. Part of the 8-bit Mario series, this pixelated figure celebrates gaming's retro roots and the evolution of Mario through gaming history.",
  "8-Bit Mario Modern Color": "This 8-Bit Mario Modern Color amiibo pays homage to Mario's classic 8-bit sprite from the original NES games. Part of the 8-bit Mario series, this pixelated figure celebrates gaming's retro roots and the evolution of Mario through gaming history.",
  "A.K.I": "A.K.I is a character from Street Fighter. This A.K.I card from the Street Fighter 6 series represents A.K.I as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Ace": "Ace is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Ace to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Admiral": "Admiral is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Admiral to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Agent S": "Agent S is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Agent S to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Agnes": "Agnes is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Agnes to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Akuma": "Akuma is a character from Street Fighter. This Akuma card from the Street Fighter 6 series represents Akuma as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Al": "Al is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Al to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Alex": "Alex is a playable character in Minecraft. This Super Smash Bros. series amiibo represents the alternative player skin who explores, mines, crafts, and builds in Minecraft's infinite procedurally generated worlds.",
  "Alfonso": "Alfonso is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Alfonso to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Alice": "Alice is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Alice to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Alli": "Alli is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Alli to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Alm": "Alm is a character from Fire Emblem. This Alm figure from the Fire Emblem series represents Alm as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Amelia": "Amelia is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Amelia to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Anabelle": "Anabelle is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Anabelle to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Anchovy": "Anchovy is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Anchovy to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Angus": "Angus is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Angus to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Anicotti": "Anicotti is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Anicotti to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Ankha": "Ankha is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Ankha to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Annalisa": "Annalisa is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Annalisa to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Annalise": "Annalise is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Annalise to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Antonio": "Antonio is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Antonio to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Apollo": "Apollo is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Apollo to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Apple": "Apple is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Apple to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Asana Mutsuba": "Asana Mutsuba is a character from Yu-Gi-Oh!. This Asana Mutsuba card from the Yu-Gi-Oh! series represents Asana Mutsuba as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Astrid": "Astrid is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Astrid to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Audie": "Audie is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Audie to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Aurora": "Aurora is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Aurora to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Ava": "Ava is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Ava to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Avery": "Avery is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Avery to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Axel": "Axel is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Axel to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Azalea": "Azalea is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Azalea to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Baabara": "Baabara is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Baabara to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Baby Luigi - Baseball": "Baby Luigi is a character from Mario Sports Superstars. This Baby Luigi - Baseball card from the Mario Sports Superstars series represents Baby Luigi as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Baby Luigi - Golf": "Baby Luigi is a character from Mario Sports Superstars. This Baby Luigi - Golf card from the Mario Sports Superstars series represents Baby Luigi as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Baby Luigi - Horse Racing": "Baby Luigi is a character from Mario Sports Superstars. This Baby Luigi - Horse Racing card from the Mario Sports Superstars series represents Baby Luigi as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Baby Luigi - Soccer": "Baby Luigi is a character from Mario Sports Superstars. This Baby Luigi - Soccer card from the Mario Sports Superstars series represents Baby Luigi as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Baby Luigi - Tennis": "Baby Luigi is a character from Mario Sports Superstars. This Baby Luigi - Tennis card from the Mario Sports Superstars series represents Baby Luigi as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Baby Mario - Baseball": "Baby Mario is a character from Mario Sports Superstars. This Baby Mario - Baseball card from the Mario Sports Superstars series represents Baby Mario as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Baby Mario - Golf": "Baby Mario is a character from Mario Sports Superstars. This Baby Mario - Golf card from the Mario Sports Superstars series represents Baby Mario as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Baby Mario - Horse Racing": "Baby Mario is a character from Mario Sports Superstars. This Baby Mario - Horse Racing card from the Mario Sports Superstars series represents Baby Mario as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Baby Mario - Soccer": "Baby Mario is a character from Mario Sports Superstars. This Baby Mario - Soccer card from the Mario Sports Superstars series represents Baby Mario as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Baby Mario - Tennis": "Baby Mario is a character from Mario Sports Superstars. This Baby Mario - Tennis card from the Mario Sports Superstars series represents Baby Mario as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Bam": "Bam is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Bam to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Bandana Waddle Dee": "Bandana Waddle Dee (also known as Bandana Dee) is King Dedede's loyal spear-wielding servant who has become a hero in his own right. This Kirby Air Riders series amiibo represents the brave Waddle Dee who joins Kirby and friends on adventures to protect Dream Land.",
  "Bangle": "Bangle is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Bangle to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Banjo & Kazooie": "Banjo is a character from Banjo Kazooie. This Banjo & Kazooie figure from the Super Smash Bros. series represents Banjo as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Barioth and Ayuria": "Barioth is a character from Monster Hunter. This Barioth and Ayuria figure from the Monster Hunter series represents Barioth as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Barold": "Barold is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Barold to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Bayonetta": "Bayonetta is the stylish Umbra Witch who battles angels and demons. This Super Smash Bros. series amiibo represents the gun-wielding, time-manipulating warrior known for her over-the-top combat and fashionable appearance.",
  "Bayonetta - Player 2": "This Bayonetta - Player 2 amiibo features Bayonetta in her alternate costume. From the Super Smash Bros. series, this variant showcases the Umbra Witch with her signature style and devastating combat abilities from Bayonetta 2.",
  "Bea": "Bea is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Bea to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Beardo": "Beardo is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Beardo to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Beau": "Beau is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Beau to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Becky": "Becky is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Becky to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Bella": "Bella is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Bella to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Benedict": "Benedict is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Benedict to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Benjamin": "Benjamin is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Benjamin to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Bertha": "Bertha is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Bertha to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Bettina": "Bettina is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Bettina to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Bianca": "Bianca is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Bianca to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Biff": "Biff is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Biff to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Big Man": "Big Man is a character from Splatoon. This Big Man figure from the Splatoon series represents Big Man as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Big Top": "Big Top is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Big Top to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Bill": "Bill is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Bill to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Billy": "Billy is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Billy to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Birdo - Baseball": "Birdo is a character from Mario Sports Superstars. This Birdo - Baseball card from the Mario Sports Superstars series represents Birdo as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Birdo - Golf": "Birdo is a character from Mario Sports Superstars. This Birdo - Golf card from the Mario Sports Superstars series represents Birdo as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Birdo - Horse Racing": "Birdo is a character from Mario Sports Superstars. This Birdo - Horse Racing card from the Mario Sports Superstars series represents Birdo as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Birdo - Soccer": "Birdo is a character from Mario Sports Superstars. This Birdo - Soccer card from the Mario Sports Superstars series represents Birdo as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Birdo - Tennis": "Birdo is a character from Mario Sports Superstars. This Birdo - Tennis card from the Mario Sports Superstars series represents Birdo as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Biskit": "Biskit is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Biskit to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Bitty": "Bitty is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Bitty to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Blaire": "Blaire is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Blaire to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Blanca": "Blanca is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Blanca to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Blanche": "Blanche is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Blanche to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Blanka": "Blanka is a character from Street Fighter. This Blanka card from the Street Fighter 6 series represents Blanka as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Blathers": "Blathers is a character from Animal Crossing. This Blathers figure from the Animal Crossing series represents Blathers as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Bluebear": "Bluebear is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Bluebear to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Bob": "Bob is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Bob to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Bokoblin": "Bokoblin is a character from The Legend of Zelda. This Bokoblin figure from the Legend Of Zelda series represents Bokoblin as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Bonbon": "Bonbon is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Bonbon to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Bones": "Bones is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Bones to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Boo": "Boo is a character from Super Mario. This Boo figure from the Super Mario Bros. series represents Boo as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Boo - Baseball": "Boo is a character from Mario Sports Superstars. This Boo - Baseball card from the Mario Sports Superstars series represents Boo as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Boo - Golf": "Boo is a character from Mario Sports Superstars. This Boo - Golf card from the Mario Sports Superstars series represents Boo as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Boo - Horse Racing": "Boo is a character from Mario Sports Superstars. This Boo - Horse Racing card from the Mario Sports Superstars series represents Boo as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Boo - Soccer": "Boo is a character from Mario Sports Superstars. This Boo - Soccer card from the Mario Sports Superstars series represents Boo as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Boo - Tennis": "Boo is a character from Mario Sports Superstars. This Boo - Tennis card from the Mario Sports Superstars series represents Boo as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Booker": "Booker is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Booker to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Boomer": "Boomer is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Boomer to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Boone": "Boone is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Boone to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Boots": "Boots is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Boots to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Boris": "Boris is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Boris to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Bowser": "Bowser is the King of the Koopas and Mario's arch-nemesis, constantly scheming to kidnap Princess Peach and conquer the Mushroom Kingdom. This Bowser amiibo showcases the Koopa King as a powerful heavyweight fighter in Super Smash Bros., using fire breath and devastating throws.",
  "Bowser - Baseball": "Bowser is the King of the Koopas and Mario's arch-nemesis, constantly scheming to kidnap Princess Peach and conquer the Mushroom Kingdom. This Mario Sports Superstars series amiibo represents Bowser in their role as a fighter or character across Nintendo's gaming universe.",
  "Bowser - Golf": "Bowser is the King of the Koopas and Mario's arch-nemesis, constantly scheming to kidnap Princess Peach and conquer the Mushroom Kingdom. This Mario Sports Superstars series amiibo represents Bowser in their role as a fighter or character across Nintendo's gaming universe.",
  "Bowser - Horse Racing": "Bowser is the King of the Koopas and Mario's arch-nemesis, constantly scheming to kidnap Princess Peach and conquer the Mushroom Kingdom. This Mario Sports Superstars series amiibo represents Bowser in their role as a fighter or character across Nintendo's gaming universe.",
  "Bowser - Soccer": "Bowser is the King of the Koopas and Mario's arch-nemesis, constantly scheming to kidnap Princess Peach and conquer the Mushroom Kingdom. This Mario Sports Superstars series amiibo represents Bowser in their role as a fighter or character across Nintendo's gaming universe.",
  "Bowser - Tennis": "Bowser is the King of the Koopas and Mario's arch-nemesis, constantly scheming to kidnap Princess Peach and conquer the Mushroom Kingdom. This Mario Sports Superstars series amiibo represents Bowser in their role as a fighter or character across Nintendo's gaming universe.",
  "Bowser - Wedding": "This Bowser - Wedding amiibo celebrates Bowser's appearance in Super Mario Odyssey's wedding-themed levels. Dressed in formal attire from the Super Mario Bros. series, this figure captures a memorable and lighthearted moment from Mario's globe-trotting adventure.",
  "Bowser Jr.": "Bowser Jr. is Bowser's mischievous son and heir to the Koopa Kingdom. This Super Smash Bros. series amiibo features the young Koopa who pilots his Junior Clown Car and transforms into Shadow Mario, following in his father's footsteps while showing genuine love for his dad.",
  "Bowser Jr. - Baseball": "Bowser Jr. is Bowser's mischievous son and heir to the Koopa Kingdom. This Mario Sports Superstars series amiibo features the young Koopa who pilots his Junior Clown Car and transforms into Shadow Mario, following in his father's footsteps while showing genuine love for his dad.",
  "Bowser Jr. - Golf": "Bowser Jr. is Bowser's mischievous son and heir to the Koopa Kingdom. This Mario Sports Superstars series amiibo features the young Koopa who pilots his Junior Clown Car and transforms into Shadow Mario, following in his father's footsteps while showing genuine love for his dad.",
  "Bowser Jr. - Horse Racing": "Bowser Jr. is Bowser's mischievous son and heir to the Koopa Kingdom. This Mario Sports Superstars series amiibo features the young Koopa who pilots his Junior Clown Car and transforms into Shadow Mario, following in his father's footsteps while showing genuine love for his dad.",
  "Bowser Jr. - Soccer": "Bowser Jr. is Bowser's mischievous son and heir to the Koopa Kingdom. This Mario Sports Superstars series amiibo features the young Koopa who pilots his Junior Clown Car and transforms into Shadow Mario, following in his father's footsteps while showing genuine love for his dad.",
  "Bowser Jr. - Tennis": "Bowser Jr. is Bowser's mischievous son and heir to the Koopa Kingdom. This Mario Sports Superstars series amiibo features the young Koopa who pilots his Junior Clown Car and transforms into Shadow Mario, following in his father's footsteps while showing genuine love for his dad.",
  "Boyd": "Boyd is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Boyd to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Bree": "Bree is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Bree to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Brewster": "Brewster is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Brewster to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Broccolo": "Broccolo is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Broccolo to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Broffina": "Broffina is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Broffina to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Bruce": "Bruce is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Bruce to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Bubbles": "Bubbles is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Bubbles to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Buck": "Buck is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Buck to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Bud": "Bud is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Bud to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Bunnie": "Bunnie is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Bunnie to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Butch": "Butch is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Butch to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Buzz": "Buzz is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Buzz to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Byleth": "Byleth is a character from Fire Emblem. This Byleth figure from the Super Smash Bros. series represents Byleth as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "C. Viper": "C. Viper is a character from Street Fighter. This C. Viper card from the Street Fighter 6 series represents C. Viper as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "C.J.": "C.J. is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite C.J. to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Callie": "Callie is one half of the Squid Sisters, the pop idol duo from Splatoon. This Splatoon series amiibo features the energetic and optimistic Callie, known for her role as a news anchor and her iconic pink tentacles.",
  "Callie - Alterna": "Callie is one half of the Squid Sisters, the pop idol duo from Splatoon. This Splatoon series amiibo features the energetic and optimistic Callie, known for her role as a news anchor and her iconic pink tentacles.",
  "Cally": "Cally is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Cally to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Cammy": "Cammy is a character from Street Fighter. This Cammy card from the Street Fighter 6 series represents Cammy as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Camofrog": "Camofrog is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Camofrog to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Canberra": "Canberra is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Canberra to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Candi": "Candi is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Candi to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Captain Falcon": "Captain Falcon is a character from F-Zero. This Captain Falcon figure from the Super Smash Bros. series represents Captain Falcon as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Carmen": "Carmen is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Carmen to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Caroline": "Caroline is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Caroline to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Carrie": "Carrie is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Carrie to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Cashmere": "Cashmere is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Cashmere to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Celeste": "Celeste is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Celeste to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Celia": "Celia is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Celia to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Celica": "Celica is a character from Fire Emblem. This Celica figure from the Fire Emblem series represents Celica as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Cephalobot": "Cephalobot is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Cephalobot to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Cesar": "Cesar is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Cesar to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Chabwick": "Chabwick is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Chabwick to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Chadder": "Chadder is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Chadder to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Chai": "Chai is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Chai to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Charizard": "Charizard is the powerful Fire/Flying-type Pokémon that evolves from Charmeleon. This Super Smash Bros. series amiibo features the fan-favorite dragon-like Pokémon with flames blazing, representing one of the most iconic Pokémon from the original 151.",
  "Charlise": "Charlise is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Charlise to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Chelsea": "Chelsea is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Chelsea to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Cheri": "Cheri is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Cheri to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Cherry": "Cherry is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Cherry to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Chester": "Chester is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Chester to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Chevre": "Chevre is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Chevre to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Chibi Robo": "Chibi-Robo is a character from Chibi Robo. This Chibi Robo figure from the Chibi-Robo! series represents Chibi-Robo as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Chief": "Chief is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Chief to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Chip": "Chip is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Chip to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Chops": "Chops is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Chops to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Chow": "Chow is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Chow to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Chrissy": "Chrissy is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Chrissy to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Chrom": "Chrom is a character from Fire Emblem. This Chrom figure from the Fire Emblem series represents Chrom as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Chun-Li": "Chun-Li is a character from Street Fighter. This Chun-Li card from the Street Fighter 6 series represents Chun-Li as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Claude": "Claude is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Claude to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Claudia": "Claudia is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Claudia to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Clay": "Clay is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Clay to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Cleo": "Cleo is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Cleo to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Cloud": "Cloud Strife is a character from Final Fantasy. This Cloud figure from the Super Smash Bros. series represents Cloud Strife as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Cloud - Player 2": "Cloud Strife is a character from Final Fantasy. This Cloud - Player 2 figure from the Super Smash Bros. series represents Cloud Strife as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Clyde": "Clyde is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Clyde to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Coach": "Coach is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Coach to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Cobb": "Cobb is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Cobb to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Coco": "Coco is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Coco to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Cole": "Cole is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Cole to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Colton": "Colton is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Colton to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Cookie": "Cookie is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Cookie to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Copper": "Copper is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Copper to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Corrin": "Corrin is the protagonist of Fire Emblem Fates who can transform into a dragon. This Super Smash Bros. series amiibo represents the warrior born to both the Hoshido and Nohr royal families, forced to make difficult choices that shape the fate of nations.",
  "Corrin - Player 2": "This Corrin - Player 2 amiibo features the female Corrin from Fire Emblem Fates. From the Super Smash Bros. series, this figure showcases the dragon-blood warrior who must choose between two kingdoms in a complex tale of loyalty and family.",
  "Cousteau": "Cousteau is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Cousteau to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Cranston": "Cranston is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Cranston to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Croque": "Croque is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Croque to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Cube": "Cube is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Cube to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Curlos": "Curlos is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Curlos to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Curly": "Curly is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Curly to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Curt": "Curt is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Curt to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Cyd": "Cyd is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Cyd to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Cyrano": "Cyrano is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Cyrano to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Cyrus": "Cyrus is a character from Animal Crossing. This Cyrus figure from the Animal Crossing series represents Cyrus as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "DJ KK": "K.K. Slider is the traveling musician dog who performs concerts in Animal Crossing. This Animal Crossing series amiibo captures the laid-back performer with his guitar, bringing new songs to players every Saturday night and becoming a beloved cultural icon of the series.",
  "Daijobu": "Daijobu is a character from Power Pros. This Daijobu card from the Power Pros series represents Daijobu as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Daisy": "Daisy is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Daisy to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Daisy - Baseball": "Daisy is a character from Mario Sports Superstars. This Daisy - Baseball card from the Mario Sports Superstars series represents Daisy as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Daisy - Golf": "Daisy is a character from Mario Sports Superstars. This Daisy - Golf card from the Mario Sports Superstars series represents Daisy as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Daisy - Horse Racing": "Daisy is a character from Mario Sports Superstars. This Daisy - Horse Racing card from the Mario Sports Superstars series represents Daisy as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Daisy - Power Up Band": "Daisy is a character from Super Mario. This Daisy - Power Up Band band from the Super Nintendo World series represents Daisy as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Daisy - Soccer": "Daisy is a character from Mario Sports Superstars. This Daisy - Soccer card from the Mario Sports Superstars series represents Daisy as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Daisy - Tennis": "Daisy is a character from Mario Sports Superstars. This Daisy - Tennis card from the Mario Sports Superstars series represents Daisy as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Daisy Mae": "Daisy Mae is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Daisy Mae to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Dark Pit": "Dark Pit is a character from Kid Icarus. This Dark Pit figure from the Super Smash Bros. series represents Dark Pit as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Dark Samus": "Dark Samus is Samus Aran's evil doppelganger born from Phazon corruption in the Metroid Prime series. This Super Smash Bros. series amiibo represents the malevolent entity with its distinctive blue and black coloration, serving as one of Samus's most persistent threats.",
  "Daruk": "Daruk is a character from The Legend of Zelda. This Daruk figure from the Legend Of Zelda series represents Daruk as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Dee Jay": "Dee Jay is a character from Street Fighter. This Dee Jay card from the Street Fighter 6 series represents Dee Jay as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Deena": "Deena is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Deena to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Deirdre": "Deirdre is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Deirdre to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Del": "Del is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Del to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Deli": "Deli is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Deli to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Derwin": "Derwin is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Derwin to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Detective Pikachu": "Detective Pikachu is a character from Pokemon. This Detective Pikachu figure from the Pokemon series represents Detective Pikachu as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Dhalsim": "Dhalsim is a character from Street Fighter. This Dhalsim card from the Street Fighter 6 series represents Dhalsim as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Diana": "Diana is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Diana to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Diddy Kong": "Diddy Kong is a character from Super Mario. This Diddy Kong figure from the Super Smash Bros. series represents Diddy Kong as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Diddy Kong - Baseball": "Diddy Kong is a character from Mario Sports Superstars. This Diddy Kong - Baseball card from the Mario Sports Superstars series represents Diddy Kong as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Diddy Kong - Golf": "Diddy Kong is a character from Mario Sports Superstars. This Diddy Kong - Golf card from the Mario Sports Superstars series represents Diddy Kong as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Diddy Kong - Horse Racing": "Diddy Kong is a character from Mario Sports Superstars. This Diddy Kong - Horse Racing card from the Mario Sports Superstars series represents Diddy Kong as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Diddy Kong - Power Up Band": "Diddy Kong is a character from Super Mario. This Diddy Kong - Power Up Band band from the Super Nintendo World series represents Diddy Kong as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Diddy Kong - Soccer": "Diddy Kong is a character from Mario Sports Superstars. This Diddy Kong - Soccer card from the Mario Sports Superstars series represents Diddy Kong as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Diddy Kong - Tennis": "Diddy Kong is a character from Mario Sports Superstars. This Diddy Kong - Tennis card from the Mario Sports Superstars series represents Diddy Kong as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Digby": "Digby is a character from Animal Crossing. This Digby figure from the Animal Crossing series represents Digby as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Digby - Raincoat": "Digby is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Digby to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Diva": "Diva is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Diva to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Dizzy": "Dizzy is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Dizzy to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Dobie": "Dobie is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Dobie to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Doc": "Doc is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Doc to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Dom": "Dom is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Dom to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Don Resetti": "Don Resetti is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Don Resetti to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Don Resetti - Without Hat": "Don Resetti is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Don Resetti to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Donkey Kong": "Donkey Kong is the powerful leader of the Kong family, known for his incredible strength and his mission to protect his banana hoard. This Donkey Kong amiibo showcases the mighty ape as a powerhouse fighter in Super Smash Bros., using his strength for devastating grabs and slams.",
  "Donkey Kong & Pauline": "Donkey Kong is the powerful leader of the Kong family, known for his incredible strength and his mission to protect his banana hoard. This Donkey Kong series amiibo represents Donkey Kong in their role as a fighter or character across Nintendo's gaming universe.",
  "Donkey Kong - Baseball": "Donkey Kong is the powerful leader of the Kong family, known for his incredible strength and his mission to protect his banana hoard. This Mario Sports Superstars series amiibo represents Donkey Kong in their role as a fighter or character across Nintendo's gaming universe.",
  "Donkey Kong - Golf": "Donkey Kong is the powerful leader of the Kong family, known for his incredible strength and his mission to protect his banana hoard. This Mario Sports Superstars series amiibo represents Donkey Kong in their role as a fighter or character across Nintendo's gaming universe.",
  "Donkey Kong - Horse Racing": "Donkey Kong is the powerful leader of the Kong family, known for his incredible strength and his mission to protect his banana hoard. This Mario Sports Superstars series amiibo represents Donkey Kong in their role as a fighter or character across Nintendo's gaming universe.",
  "Donkey Kong - Power Up Band": "Donkey Kong is the powerful leader of the Kong family, known for his incredible strength and his mission to protect his banana hoard. This Super Nintendo World series amiibo represents Donkey Kong in their role as a fighter or character across Nintendo's gaming universe.",
  "Donkey Kong - Soccer": "Donkey Kong is the powerful leader of the Kong family, known for his incredible strength and his mission to protect his banana hoard. This Mario Sports Superstars series amiibo represents Donkey Kong in their role as a fighter or character across Nintendo's gaming universe.",
  "Donkey Kong - Tennis": "Donkey Kong is the powerful leader of the Kong family, known for his incredible strength and his mission to protect his banana hoard. This Mario Sports Superstars series amiibo represents Donkey Kong in their role as a fighter or character across Nintendo's gaming universe.",
  "Dora": "Dora is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Dora to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Dotty": "Dotty is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Dotty to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Dr. Mario": "Dr. Mario is Mario's alter ego as a physician in the puzzle game series. Wearing his white lab coat and armed with vitamins to eliminate viruses, this Super Smash Bros. series amiibo represents Mario's medical career fighting colorful germs in fast-paced puzzle action.",
  "Drago": "Drago is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Drago to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Drake": "Drake is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Drake to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Drift": "Drift is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Drift to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Duck Hunt": "Duck Hunt is a character from Classic Nintendo. This Duck Hunt figure from the Super Smash Bros. series represents Duck Hunt as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "E. Honda": "E. Honda is a character from Street Fighter. This E. Honda card from the Street Fighter 6 series represents E. Honda as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "E.M.M.I.": "E.M.M.I. is a character from Metroid. This E.M.M.I. figure from the Metroid series represents E.M.M.I. as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Ed": "Ed is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Ed to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Egbert": "Egbert is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Egbert to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Elena": "Elena is a character from Street Fighter. This Elena card from the Street Fighter 6 series represents Elena as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Elise": "Elise is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Elise to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Ellie": "Ellie is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Ellie to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Elmer": "Elmer is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Elmer to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Eloise": "Eloise is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Eloise to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Elvis": "Elvis is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Elvis to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Ena": "Ena is a character from Monster Hunter. This Ena figure from the Monster Hunter series represents Ena as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Erik": "Erik is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Erik to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Eugene": "Eugene is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Eugene to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Eunice": "Eunice is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Eunice to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Faith": "Faith is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Faith to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Falco": "Falco Lombardi is Fox McCloud's hot-headed wingman and ace pilot of Team Star Fox. This Super Smash Bros. series amiibo showcases the skilled pilot who prefers the air over land, often challenging Fox while remaining a loyal teammate.",
  "Fang": "Fang is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Fang to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Fauna": "Fauna is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Fauna to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Felicity": "Felicity is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Felicity to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Filbert": "Filbert is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Filbert to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Flick": "Flick is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Flick to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Flip": "Flip is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Flip to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Flo": "Flo is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Flo to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Flora": "Flora is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Flora to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Flurry": "Flurry is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Flurry to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Fox": "Fox McCloud is the leader of Star Fox, an elite team of mercenary pilots. This Super Smash Bros. series amiibo represents the ace pilot who flies the Arwing through the Lylat System, following his father's legacy while protecting the galaxy from Andross and other threats.",
  "Francine": "Francine is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Francine to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Frank": "Frank is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Frank to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Franklin": "Franklin is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Franklin to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Freckles": "Freckles is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Freckles to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Frett": "Frett is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Frett to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Freya": "Freya is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Freya to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Friga": "Friga is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Friga to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Frita": "Frita is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Frita to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Frobert": "Frobert is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Frobert to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Frye": "Frye is a character from Splatoon. This Frye figure from the Splatoon series represents Frye as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Fuchsia": "Fuchsia is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Fuchsia to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Gabi": "Gabi is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Gabi to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Gakuto Sōgetsu": "Gakuto Sōgetsu is a character from Yu-Gi-Oh!. This Gakuto Sōgetsu card from the Yu-Gi-Oh! series represents Gakuto Sōgetsu as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Gala": "Gala is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Gala to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Ganda": "Ganda is a character from Power Pros. This Ganda card from the Power Pros series represents Ganda as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Ganondorf": "Ganondorf is the Gerudo King and the primary antagonist of The Legend of Zelda series. This Super Smash Bros. series amiibo represents the human form of Ganon, wielding dark magic and a massive sword. As the bearer of the Triforce of Power, Ganondorf's ambition to conquer Hyrule makes him Link's ultimate nemesis.",
  "Ganondorf - Tears of the Kingdom": "Ganondorf is the Gerudo King and the primary antagonist of The Legend of Zelda series. This Legend Of Zelda series amiibo represents the human form of Ganon, wielding dark magic and a massive sword. As the bearer of the Triforce of Power, Ganondorf's ambition to conquer Hyrule makes him Link's ultimate nemesis.",
  "Gaston": "Gaston is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Gaston to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Gayle": "Gayle is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Gayle to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Genji": "Genji is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Genji to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Gigi": "Gigi is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Gigi to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Gladys": "Gladys is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Gladys to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Gloria": "Gloria is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Gloria to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Golden - Power Up Band": "This special Gold Edition Mario amiibo features a luxurious golden finish, making it a premium collectible variant. Released as part of the Super Nintendo World series, this gleaming figure represents Mario in a stunning metallic form that catches the eye of any collector.",
  "Goldie": "Goldie is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Goldie to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Goldie - Amiibo Festival": "Goldie is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Goldie to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Gonzo": "Gonzo is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Gonzo to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Goomba": "Goomba is a character from Super Mario. This Goomba figure from the Super Mario Bros. series represents Goomba as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Goose": "Goose is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Goose to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Gracie": "Gracie is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Gracie to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Graham": "Graham is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Graham to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Grams": "Grams is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Grams to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Green Yarn Yoshi": "This Green Yarn Yoshi amiibo features Yoshi in an adorable yarn crafted form from Yoshi's Woolly World. Made to look like a hand-knitted plush toy, this Yoshi's Woolly World series figure captures the soft, textile aesthetic of the yarn-based platformer.",
  "Greninja": "Greninja is the Ninja Pokémon, a Water/Dark-type known for incredible speed and stealth. This Super Smash Bros. series amiibo showcases the Generation VI starter's final evolution, creating throwing stars from compressed water.",
  "Greta": "Greta is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Greta to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Grizzly": "Grizzly is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Grizzly to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Groucho": "Groucho is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Groucho to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Gruff": "Gruff is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Gruff to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Guardian": "Guardian is a character from The Legend of Zelda. This Guardian figure from the Legend Of Zelda series represents Guardian as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Guile": "Guile is a character from Street Fighter. This Guile card from the Street Fighter 6 series represents Guile as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Gulliver": "Gulliver is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Gulliver to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Gwen": "Gwen is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Gwen to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Hamlet": "Hamlet is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Hamlet to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Hammer Slam Bowser": "Bowser is the King of the Koopas and Mario's arch-nemesis, constantly scheming to kidnap Princess Peach and conquer the Mushroom Kingdom. This Skylanders series amiibo represents Bowser in their role as a fighter or character across Nintendo's gaming universe.",
  "Hamphrey": "Hamphrey is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Hamphrey to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Hans": "Hans is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Hans to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Harriet": "Harriet is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Harriet to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Harry": "Harry is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Harry to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Harvey": "Harvey is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Harvey to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Hayakawa": "Hayakawa is a character from Power Pros. This Hayakawa card from the Power Pros series represents Hayakawa as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Hazel": "Hazel is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Hazel to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Henry": "Henry is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Henry to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Hero": "Hero is a character from Dragon Quest. This Hero figure from the Super Smash Bros. series represents Hero as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Hippeux": "Hippeux is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Hippeux to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Hopkins": "Hopkins is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Hopkins to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Hopper": "Hopper is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Hopper to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Hornsby": "Hornsby is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Hornsby to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Huck": "Huck is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Huck to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Hugh": "Hugh is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Hugh to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Ice Climbers": "Ice Climbers is a character from Classic Nintendo. This Ice Climbers figure from the Super Smash Bros. series represents Ice Climbers as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Iggly": "Iggly is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Iggly to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Ikari": "Ikari is a character from Power Pros. This Ikari card from the Power Pros series represents Ikari as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Ike": "Ike is a character from Fire Emblem. This Ike figure from the Super Smash Bros. series represents Ike as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Incineroar": "Incineroar is the Heel Pokémon, a Fire/Dark-type that loves to showboat. This Super Smash Bros. series amiibo features the wrestling-themed Generation VII starter evolution with its theatrical personality and flame belt.",
  "Ingrid": "Ingrid is a character from Street Fighter. This Ingrid card from the Street Fighter 6 series represents Ingrid as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Inkling": "This Inkling amiibo features an Inkling from Splatoon. From the Super Smash Bros. series, these squid-kids can transform between humanoid and squid forms while battling in turf wars with ink-based weapons.",
  "Inkling - Yellow": "This Inkling - Yellow amiibo features an Inkling from Splatoon. From the Splatoon series, these squid-kids can transform between humanoid and squid forms while battling in turf wars with ink-based weapons.",
  "Inkling Boy": "This Inkling Boy amiibo represents a male squid-kid from Splatoon. Part of the Splatoon series, this figure captures the fresh fashion and competitive spirit of turf war battles with ink-based weapons.",
  "Inkling Boy - Neon Green": "This Inkling Boy amiibo represents a male squid-kid from Splatoon. Part of the Splatoon series, this figure captures the fresh fashion and competitive spirit of turf war battles with ink-based weapons.",
  "Inkling Boy - Purple": "This Inkling Boy amiibo represents a male squid-kid from Splatoon. Part of the Splatoon series, this figure captures the fresh fashion and competitive spirit of turf war battles with ink-based weapons.",
  "Inkling Girl": "This Inkling Girl amiibo features a female squid-kid from Splatoon. From the Splatoon series, this figure showcases the stylish and energetic nature of Inkopolis's youth in colorful ink battles.",
  "Inkling Girl - Lime Green": "This Inkling Girl amiibo features a female squid-kid from Splatoon. From the Splatoon series, this figure showcases the stylish and energetic nature of Inkopolis's youth in colorful ink battles.",
  "Inkling Girl - Neon Pink": "This Inkling Girl amiibo features a female squid-kid from Splatoon. From the Splatoon series, this figure showcases the stylish and energetic nature of Inkopolis's youth in colorful ink battles.",
  "Inkling Squid": "This Inkling Squid amiibo shows an Inkling in its squid form from Splatoon. Part of the Splatoon series, this figure represents the transformation that allows Inklings to swim through ink and navigate the battlefield.",
  "Inkling Squid - Neon Purple": "This Inkling Squid amiibo shows an Inkling in its squid form from Splatoon. Part of the Splatoon series, this figure represents the transformation that allows Inklings to swim through ink and navigate the battlefield.",
  "Inkling Squid - Orange": "This Inkling Squid amiibo shows an Inkling in its squid form from Splatoon. Part of the Splatoon series, this figure represents the transformation that allows Inklings to swim through ink and navigate the battlefield.",
  "Ione": "Ione is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Ione to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Isabelle": "Isabelle is the cheerful, hardworking secretary from Animal Crossing. This Animal Crossing series amiibo showcases the beloved Shih Tzu who assists with town management and has become the face of the Animal Crossing franchise.",
  "Isabelle - Character Parfait": "Isabelle is the cheerful, hardworking secretary from Animal Crossing. This Animal Crossing series amiibo showcases the beloved Shih Tzu who assists with town management and has become the face of the Animal Crossing franchise.",
  "Isabelle - Dress": "Isabelle is the cheerful, hardworking secretary from Animal Crossing. This Animal Crossing series amiibo showcases the beloved Shih Tzu who assists with town management and has become the face of the Animal Crossing franchise.",
  "Isabelle - Kimono": "Isabelle is the cheerful, hardworking secretary from Animal Crossing. This Animal Crossing series amiibo showcases the beloved Shih Tzu who assists with town management and has become the face of the Animal Crossing franchise.",
  "Isabelle - Summer Outfit": "Isabelle is the cheerful, hardworking secretary from Animal Crossing. This Animal Crossing series amiibo showcases the beloved Shih Tzu who assists with town management and has become the face of the Animal Crossing franchise.",
  "Isabelle - Sweater": "This Isabelle - Sweater amiibo features Isabelle in her cozy winter outfit. From the Animal Crossing series, this seasonal variant shows the dedicated secretary bundled up, bringing her cheerful assistance to Animal Crossing players even in cold weather.",
  "Isabelle - Winter": "This Isabelle - Winter amiibo features Isabelle in her cozy winter outfit. From the Animal Crossing series, this seasonal variant shows the dedicated secretary bundled up, bringing her cheerful assistance to Animal Crossing players even in cold weather.",
  "Isabelle - Winter Outfit": "This Isabelle - Winter Outfit amiibo features Isabelle in her cozy winter outfit. From the Animal Crossing series, this seasonal variant shows the dedicated secretary bundled up, bringing her cheerful assistance to Animal Crossing players even in cold weather.",
  "Ivysaur": "Ivysaur is the Seed Pokémon that evolves from Bulbasaur. This Super Smash Bros. series amiibo represents the Grass/Poison-type mid-evolution, with the bulb on its back growing larger as it prepares to evolve into Venusaur.",
  "JP": "JP is a character from Street Fighter. This JP card from the Street Fighter 6 series represents JP as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Jack": "Jack is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Jack to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Jacob": "Jacob is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Jacob to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Jacques": "Jacques is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Jacques to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Jambette": "Jambette is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Jambette to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Jamie": "Jamie is a character from Street Fighter. This Jamie figure from the Street Fighter 6 series represents Jamie as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Jay": "Jay is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Jay to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Jeremiah": "Jeremiah is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Jeremiah to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Jigglypuff": "Jigglypuff is the Balloon Pokémon known for its soothing singing voice. This Super Smash Bros. series amiibo represents the Normal/Fairy-type that puts opponents to sleep, then draws on their faces with its marker in frustration.",
  "Jingle": "Jingle is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Jingle to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Jitters": "Jitters is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Jitters to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Joan": "Joan is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Joan to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Joey": "Joey is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Joey to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Joker": "Joker is a character from Persona. This Joker figure from the Super Smash Bros. series represents Joker as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Judy": "Judy is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Judy to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Julia": "Julia is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Julia to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Julian": "Julian is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Julian to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "June": "June is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite June to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Juri": "Juri is a character from Street Fighter. This Juri card from the Street Fighter 6 series represents Juri as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "K. K. Slider": "K.K. Slider is the traveling musician dog who performs concerts in Animal Crossing. This Animal Crossing series amiibo captures the laid-back performer with his guitar, bringing new songs to players every Saturday night and becoming a beloved cultural icon of the series.",
  "K. K. Slider - Pikopuri": "K.K. Slider is the traveling musician dog who performs concerts in Animal Crossing. This Animal Crossing series amiibo captures the laid-back performer with his guitar, bringing new songs to players every Saturday night and becoming a beloved cultural icon of the series.",
  "K.K. Slider": "K.K. Slider is the traveling musician dog who performs concerts in Animal Crossing. This Animal Crossing series amiibo captures the laid-back performer with his guitar, bringing new songs to players every Saturday night and becoming a beloved cultural icon of the series.",
  "Kabuki": "Kabuki is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Kabuki to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Kapp'n": "Kapp'n is a character from Animal Crossing. This Kapp'n figure from the Animal Crossing series represents Kapp'n as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Katie": "Katie is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Katie to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Katrina": "Katrina is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Katrina to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Katt": "Katt is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Katt to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Kazuya": "Kazuya is a character from Tekken. This Kazuya figure from the Super Smash Bros. series represents Kazuya as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Keaton": "Keaton is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Keaton to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Ken": "Ken is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Ken to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Ketchup": "Ketchup is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Ketchup to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Kevin": "Kevin is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Kevin to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Kicks": "Kicks is a character from Animal Crossing. This Kicks figure from the Animal Crossing series represents Kicks as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Kid Cat": "This Kid Cat amiibo features Kid Cat wearing the Super Bell power-up from Super Mario 3D World. With feline ears, paws, and the ability to climb walls and pounce on enemies, this Animal Crossing series figure captures one of Mario's most playful power-ups.",
  "Kidd": "Kidd is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Kidd to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Kiki": "Kiki is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Kiki to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Kimberly": "Kimberly is a character from Street Fighter. This Kimberly figure from the Street Fighter 6 series represents Kimberly as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "King Dedede": "King Dedede is the self-proclaimed king of Dream Land. This Super Smash Bros. series amiibo features the hammer-wielding penguin who serves as Kirby's frequent rival. Despite his selfish nature, Dedede occasionally helps save Dream Land when threats become too great.",
  "King K. Rool": "King K. Rool is a character from Donkey Kong. This King K. Rool figure from the Super Smash Bros. series represents King K. Rool as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "King Knight": "King Knight is a character from Shovel Knight. This King Knight figure from the Shovel Knight series represents King Knight as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Kirby": "Kirby is the adorable pink puffball from Planet Popstar who can inhale enemies and copy their abilities to save Dream Land. This Kirby amiibo represents the lovable puffball as a versatile fighter in Super Smash Bros., using his copy ability to steal opponents' powers.",
  "Kitt": "Kitt is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Kitt to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Kitty": "Kitty is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Kitty to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Klaus": "Klaus is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Klaus to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Knox": "Knox is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Knox to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Kody": "Kody is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Kody to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Koopa Troopa": "Koopa Troopa is a character from Super Mario. This Koopa Troopa figure from the Super Mario Bros. series represents Koopa Troopa as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Kyle": "Kyle is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Kyle to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Label": "Label is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Label to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Labelle": "Label is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Label to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Leif": "Leif is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Leif to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Leila": "Leila is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Leila to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Leilani": "Leilani is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Leilani to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Leonardo": "Leonardo is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Leonardo to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Leopold": "Leopold is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Leopold to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Light Blue Yarn Yoshi": "This Light Blue Yarn Yoshi amiibo features Yoshi in an adorable yarn crafted form from Yoshi's Woolly World. Made to look like a hand-knitted plush toy, this Yoshi's Woolly World series figure captures the soft, textile aesthetic of the yarn-based platformer.",
  "Lily": "Lily is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Lily to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Limberg": "Limberg is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Limberg to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Link": "Link is the courageous hero of The Legend of Zelda series, destined to battle evil and save the kingdom of Hyrule across multiple timelines and incarnations. This Link amiibo represents the Hero of Time as a fierce fighter, wielding his Master Sword and Hylian Shield in Super Smash Bros. battles.",
  "Link - Archer": "This Link - Archer amiibo depicts Link drawing his bow, showcasing his archery skills. From the Legend Of Zelda series, this figure emphasizes Link's ranged combat abilities and his precision with the bow and arrow across Zelda adventures.",
  "Link - Link's Awakening": "This Link amiibo is based on The Legend of Zelda: Link's Awakening, featuring the hero in his adorable toy-like art style. From the Legend Of Zelda series, this figure captures the charming remake's unique aesthetic as Link explores Koholint Island.",
  "Link - Majora's Mask": "This Link amiibo features the hero from The Legend of Zelda: Majora's Mask. From the Legend Of Zelda series, this figure represents Link's three-day race against time to save Termina from the falling moon.",
  "Link - Ocarina of Time": "This Link amiibo showcases the Hero of Time from The Legend of Zelda: Ocarina of Time. Part of the Legend Of Zelda series, this figure represents one of gaming's most influential adventures through time and Hyrule.",
  "Link - Rider": "This Link - Rider amiibo features Link mounted on horseback, ready to ride across the fields of Hyrule. Part of the Legend Of Zelda series, this figure captures the bond between hero and steed that's essential to Link's adventures.",
  "Link - Skyward Sword": "This Link amiibo represents the hero from The Legend of Zelda: Skyward Sword, the earliest Link in the Zelda timeline. Part of the Legend Of Zelda series, this figure shows Link as he journeys between Skyloft and the surface world.",
  "Link - Tears of the Kingdom": "Link is the courageous hero of The Legend of Zelda series, destined to battle evil and save the kingdom of Hyrule across multiple timelines and incarnations. This Legend Of Zelda series amiibo represents Link in their role as a fighter or character across Nintendo's gaming universe.",
  "Link - Twilight Princess": "This Link amiibo depicts the hero from The Legend of Zelda: Twilight Princess. From the Legend Of Zelda series, this figure shows Link in his mature design as he battles through the twilit realm.",
  "Lionel": "Lionel is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Lionel to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Little Mac": "Little Mac is a character from Punch Out. This Little Mac figure from the Super Smash Bros. series represents Little Mac as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Lobo": "Lobo is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Lobo to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Lolly": "Lolly is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Lolly to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Loot Goblin": "Loot Goblin is a character from Diablo. This Loot Goblin figure from the Diablo series represents Loot Goblin as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Lopez": "Lopez is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Lopez to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Lottie": "Lottie is a character from Animal Crossing. This Lottie figure from the Animal Crossing series represents Lottie as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Lottie - Black Skirt And Bow": "Lottie is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Lottie to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Lottie - Island": "Lottie is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Lottie to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Louie": "Louie is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Louie to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Lucario": "Lucario is the Aura Pokémon, a Fighting/Psychic-type that can sense and manipulate aura energy. This Super Smash Bros. series amiibo represents the popular Generation IV Pokémon with its signature Aura Sphere attack.",
  "Lucas": "Lucas is a character from Earthbound. This Lucas figure from the Super Smash Bros. series represents Lucas as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Lucha": "Lucha is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Lucha to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Lucina": "Lucina is a character from Fire Emblem. This Lucina figure from the Super Smash Bros. series represents Lucina as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Lucky": "Lucky is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Lucky to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Lucy": "Lucy is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Lucy to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Luigi": "Luigi is Mario's younger twin brother, the hero in green who has stepped out of his brother's shadow to star in his own ghost-hunting adventures. This Super Mario Bros. series amiibo represents Luigi in their role as a fighter or character across Nintendo's gaming universe.",
  "Luigi - Baseball": "Luigi is Mario's younger twin brother, the hero in green who has stepped out of his brother's shadow to star in his own ghost-hunting adventures. This Mario Sports Superstars series amiibo represents Luigi in their role as a fighter or character across Nintendo's gaming universe.",
  "Luigi - Golf": "Luigi is Mario's younger twin brother, the hero in green who has stepped out of his brother's shadow to star in his own ghost-hunting adventures. This Mario Sports Superstars series amiibo represents Luigi in their role as a fighter or character across Nintendo's gaming universe.",
  "Luigi - Horse Racing": "Luigi is Mario's younger twin brother, the hero in green who has stepped out of his brother's shadow to star in his own ghost-hunting adventures. This Mario Sports Superstars series amiibo represents Luigi in their role as a fighter or character across Nintendo's gaming universe.",
  "Luigi - My Mario Wooden Blocks": "Luigi is Mario's younger twin brother, the hero in green who has stepped out of his brother's shadow to star in his own ghost-hunting adventures. This My Mario Wooden Blocks series amiibo represents Luigi in their role as a fighter or character across Nintendo's gaming universe.",
  "Luigi - Power Up Band": "Luigi is Mario's younger twin brother, the hero in green who has stepped out of his brother's shadow to star in his own ghost-hunting adventures. This Super Nintendo World series amiibo represents Luigi in their role as a fighter or character across Nintendo's gaming universe.",
  "Luigi - Soccer": "Luigi is Mario's younger twin brother, the hero in green who has stepped out of his brother's shadow to star in his own ghost-hunting adventures. This Mario Sports Superstars series amiibo represents Luigi in their role as a fighter or character across Nintendo's gaming universe.",
  "Luigi - Tennis": "Luigi is Mario's younger twin brother, the hero in green who has stepped out of his brother's shadow to star in his own ghost-hunting adventures. This Mario Sports Superstars series amiibo represents Luigi in their role as a fighter or character across Nintendo's gaming universe.",
  "Luke": "Luke is a character from Street Fighter. This Luke figure from the Street Fighter 6 series represents Luke as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Luna": "Luna is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Luna to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Lyle": "Lyle is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Lyle to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Lyman": "Lyman is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Lyman to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "M. Bison": "M. Bison is a character from Street Fighter. This M. Bison card from the Street Fighter 6 series represents M. Bison as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Mabel": "Mabel is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Mabel to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Mac": "Mac is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Mac to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Maddie": "Maddie is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Maddie to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Maelle": "Maelle is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Maelle to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Maggie": "Maggie is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Maggie to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Magnamalo": "Magnamalo is a character from Monster Hunter. This Magnamalo figure from the Monster Hunter Rise series represents Magnamalo as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Mai": "Mai is a character from Fatal Fury. This Mai card from the Street Fighter 6 series represents Mai as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Mallary": "Mallary is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Mallary to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Malzeno": "Malzeno is a character from Monster Hunter. This Malzeno figure from the Monster Hunter Rise series represents Malzeno as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Manon": "Manon is a character from Street Fighter. This Manon card from the Street Fighter 6 series represents Manon as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Maple": "Maple is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Maple to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Marcel": "Marcel is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Marcel to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Marcie": "Marcie is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Marcie to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Margie": "Margie is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Margie to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Marie": "Marie is one half of the Squid Sisters from Splatoon. This Splatoon series amiibo showcases the cool and sarcastic Marie, known for her green tentacles and her chemistry with cousin Callie as a news anchor and performer.",
  "Marie - Alterna": "Marie is one half of the Squid Sisters from Splatoon. This Splatoon series amiibo showcases the cool and sarcastic Marie, known for her green tentacles and her chemistry with cousin Callie as a news anchor and performer.",
  "Marina": "Marina is the DJ and singer of Off the Hook from Splatoon 2. This Animal Crossing series amiibo showcases the talented Octoling with her headphones and laid-back demeanor, performing alongside Pearl.",
  "Marina - Side Order": "Marina is the DJ and singer of Off the Hook from Splatoon 2. This Splatoon series amiibo showcases the talented Octoling with her headphones and laid-back demeanor, performing alongside Pearl.",
  "Mario": "Mario is Nintendo's iconic mascot and the cheerful plumber from the Mushroom Kingdom. Since 1985, Mario has been jumping through pipes, collecting coins, and saving Princess Peach from Bowser's clutches. This Super Mario Bros. series amiibo represents Mario in their role as a fighter or character across Nintendo's gaming universe.",
  "Mario - Baseball": "Mario is Nintendo's iconic mascot and the cheerful plumber from the Mushroom Kingdom. Since 1985, Mario has been jumping through pipes, collecting coins, and saving Princess Peach from Bowser's clutches. This sporty Mario amiibo showcases the plumber's athletic versatility across soccer, baseball, tennis, golf, and horse racing.",
  "Mario - Cat": "This Mario - Cat amiibo features Mario wearing the Super Bell power-up from Super Mario 3D World. With feline ears, paws, and the ability to climb walls and pounce on enemies, this Super Mario Bros. series figure captures one of Mario's most playful power-ups.",
  "Mario - Gold Edition": "This special Gold Edition Mario amiibo features a luxurious golden finish, making it a premium collectible variant. Released as part of the Super Mario Bros. series, this gleaming figure represents Mario in a stunning metallic form that catches the eye of any collector.",
  "Mario - Golf": "Mario is Nintendo's iconic mascot and the cheerful plumber from the Mushroom Kingdom. Since 1985, Mario has been jumping through pipes, collecting coins, and saving Princess Peach from Bowser's clutches. This sporty Mario amiibo showcases the plumber's athletic versatility across soccer, baseball, tennis, golf, and horse racing.",
  "Mario - Horse Racing": "Mario is Nintendo's iconic mascot and the cheerful plumber from the Mushroom Kingdom. Since 1985, Mario has been jumping through pipes, collecting coins, and saving Princess Peach from Bowser's clutches. This sporty Mario amiibo showcases the plumber's athletic versatility across soccer, baseball, tennis, golf, and horse racing.",
  "Mario - My Mario Wooden Blocks": "Mario is Nintendo's iconic mascot and the cheerful plumber from the Mushroom Kingdom. Since 1985, Mario has been jumping through pipes, collecting coins, and saving Princess Peach from Bowser's clutches. This My Mario Wooden Blocks series amiibo represents Mario in their role as a fighter or character across Nintendo's gaming universe.",
  "Mario - Power Up Band": "Mario is Nintendo's iconic mascot and the cheerful plumber from the Mushroom Kingdom. Since 1985, Mario has been jumping through pipes, collecting coins, and saving Princess Peach from Bowser's clutches. This Super Nintendo World series amiibo represents Mario in their role as a fighter or character across Nintendo's gaming universe.",
  "Mario - Silver Edition": "This special Silver Edition Mario amiibo features a sleek silver metallic finish. As a limited variant from the Super Mario Bros. series, this chrome figure offers collectors a unique take on the classic Mario design.",
  "Mario - Soccer": "Mario is Nintendo's iconic mascot and the cheerful plumber from the Mushroom Kingdom. Since 1985, Mario has been jumping through pipes, collecting coins, and saving Princess Peach from Bowser's clutches. This sporty Mario amiibo showcases the plumber's athletic versatility across soccer, baseball, tennis, golf, and horse racing.",
  "Mario - Tennis": "Mario is Nintendo's iconic mascot and the cheerful plumber from the Mushroom Kingdom. Since 1985, Mario has been jumping through pipes, collecting coins, and saving Princess Peach from Bowser's clutches. This sporty Mario amiibo showcases the plumber's athletic versatility across soccer, baseball, tennis, golf, and horse racing.",
  "Mario - Wedding": "This Mario - Wedding amiibo celebrates Mario's appearance in Super Mario Odyssey's wedding-themed levels. Dressed in formal attire from the Super Mario Bros. series, this figure captures a memorable and lighthearted moment from Mario's globe-trotting adventure.",
  "Marisa": "Marisa is a character from Street Fighter. This Marisa card from the Street Fighter 6 series represents Marisa as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Marlo": "Marlo is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Marlo to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Marshal": "Marshal is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Marshal to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Marth": "Marth is a character from Fire Emblem. This Marth figure from the Super Smash Bros. series represents Marth as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Marty": "Marty is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Marty to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Mathilda": "Mathilda is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Mathilda to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Mega Man": "Mega Man is the Blue Bomber, the robot hero created by Dr. Light. This Mega Man series amiibo represents the legendary character who can copy defeated Robot Masters' weapons, fighting to stop Dr. Wily's evil schemes since 1987.",
  "Mega Man - Gold Edition": "This special Gold Edition Mega Man amiibo features a luxurious golden finish, making it a premium collectible variant. Released as part of the Super Smash Bros. series, this gleaming figure represents Mega Man in a stunning metallic form that catches the eye of any collector.",
  "Mega Yarn Yoshi": "This Mega Yarn Yoshi amiibo features Yoshi in an adorable yarn crafted form from Yoshi's Woolly World. Made to look like a hand-knitted plush toy, this Yoshi's Woolly World series figure captures the soft, textile aesthetic of the yarn-based platformer.",
  "Megan": "Megan is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Megan to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Melba": "Melba is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Melba to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Merengue": "Merengue is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Merengue to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Merry": "Merry is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Merry to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Meta Knight": "Meta Knight is the mysterious masked swordsman from the Kirby series. This Super Smash Bros. series amiibo showcases the honorable warrior who commands the battleship Halberd and wields the legendary sword Galaxia, serving as both Kirby's rival and occasional ally.",
  "Metal Mario - Baseball": "Metal Mario is a character from Mario Sports Superstars. This Metal Mario - Baseball card from the Mario Sports Superstars series represents Metal Mario as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Metal Mario - Golf": "Metal Mario is a character from Mario Sports Superstars. This Metal Mario - Golf card from the Mario Sports Superstars series represents Metal Mario as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Metal Mario - Horse Racing": "Metal Mario is a character from Mario Sports Superstars. This Metal Mario - Horse Racing card from the Mario Sports Superstars series represents Metal Mario as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Metal Mario - Soccer": "Metal Mario is a character from Mario Sports Superstars. This Metal Mario - Soccer card from the Mario Sports Superstars series represents Metal Mario as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Metal Mario - Tennis": "Metal Mario is a character from Mario Sports Superstars. This Metal Mario - Tennis card from the Mario Sports Superstars series represents Metal Mario as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Metroid": "Metroid is a character from Metroid. This Metroid figure from the Metroid series represents Metroid as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Mewtwo": "Mewtwo is the legendary Psychic-type Pokémon created through genetic manipulation. This Super Smash Bros. series amiibo represents the powerful clone of Mew, known for its immense psychic abilities and existential struggle with its purpose.",
  "Midge": "Midge is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Midge to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Midna & Wolf Link": "Midna is a character from The Legend of Zelda. This Midna & Wolf Link figure from the Legend Of Zelda series represents Midna as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Mii Brawler": "Mii is a character from Mii. This Mii Brawler figure from the Super Smash Bros. series represents Mii as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Mii Gunner": "Mii is a character from Mii. This Mii Gunner figure from the Super Smash Bros. series represents Mii as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Mii Swordfighter": "Mii is a character from Mii. This Mii Swordfighter figure from the Super Smash Bros. series represents Mii as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Min Min": "Min Min is a character from ARMS. This Min Min figure from the Super Smash Bros. series represents Min Min as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Mint": "Mint is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Mint to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Mio": "Mio is a character from Xenoblade. This Mio figure from the Xenoblade Chronicles 3 series represents Mio as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Mipha": "Mipha is a character from The Legend of Zelda. This Mipha figure from the Legend Of Zelda series represents Mipha as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Mira": "Mira is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Mira to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Miranda": "Miranda is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Miranda to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Mitzi": "Mitzi is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Mitzi to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Moe": "Moe is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Moe to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Molly": "Molly is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Molly to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Monique": "Monique is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Monique to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Monty": "Monty is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Monty to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Moose": "Moose is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Moose to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Mott": "Mott is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Mott to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Mr. Game & Watch": "Mr. G&W is a character from Classic Nintendo. This Mr. Game & Watch figure from the Super Smash Bros. series represents Mr. G&W as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Muffy": "Muffy is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Muffy to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Murphy": "Murphy is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Murphy to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Mythra": "Mythra is a character from Xenoblade. This Mythra figure from the Super Smash Bros. series represents Mythra as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Nabiru": "Nabiru is a character from Monster Hunter. This Nabiru figure from the Monster Hunter series represents Nabiru as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Nail Saionji": "Nail Saionji is a character from Yu-Gi-Oh!. This Nail Saionji card from the Yu-Gi-Oh! series represents Nail Saionji as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Nan": "Nan is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Nan to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Nana": "Nana is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Nana to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Naomi": "Naomi is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Naomi to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Nat": "Nat is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Nat to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Nate": "Nate is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Nate to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Ness": "Ness is a character from Earthbound. This Ness figure from the Super Smash Bros. series represents Ness as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Nibbles": "Nibbles is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Nibbles to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Niko": "Niko is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Niko to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Noah": "Noah is a character from Xenoblade. This Noah figure from the Xenoblade Chronicles 3 series represents Noah as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Norma": "Norma is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Norma to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "OHare": "OHare is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite OHare to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Octavian": "Octavian is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Octavian to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Octoling - Blue": "Octolings are the octopus-based rivals turned allies of the Inklings in Splatoon. This Splatoon series amiibo represents the formerly antagonistic species that became playable in Splatoon 2's Octo Expansion, bringing their own fresh style to turf wars.",
  "Octoling Boy": "Octolings are the octopus-based rivals turned allies of the Inklings in Splatoon. This Splatoon series amiibo represents the formerly antagonistic species that became playable in Splatoon 2's Octo Expansion, bringing their own fresh style to turf wars.",
  "Octoling Girl": "Octolings are the octopus-based rivals turned allies of the Inklings in Splatoon. This Splatoon series amiibo represents the formerly antagonistic species that became playable in Splatoon 2's Octo Expansion, bringing their own fresh style to turf wars.",
  "Octoling Octopus": "Octolings are the octopus-based rivals turned allies of the Inklings in Splatoon. This Splatoon series amiibo represents the formerly antagonistic species that became playable in Splatoon 2's Octo Expansion, bringing their own fresh style to turf wars.",
  "Olaf": "Olaf is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Olaf to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Olimar": "Olimar is a character from Pikmin. This Olimar figure from the Super Smash Bros. series represents Olimar as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Olive": "Olive is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Olive to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Olivia": "Olivia is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Olivia to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "One-Eyed Rathalos and Rider - Female": "One-Eyed Rathalos is a character from Monster Hunter. This One-Eyed Rathalos and Rider - Female figure from the Monster Hunter series represents One-Eyed Rathalos as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "One-Eyed Rathalos and Rider - Male": "One-Eyed Rathalos is a character from Monster Hunter. This One-Eyed Rathalos and Rider - Male figure from the Monster Hunter series represents One-Eyed Rathalos as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Opal": "Opal is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Opal to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Orville": "Orville is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Orville to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Ozzie": "Ozzie is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Ozzie to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Pac-Man": "PAC-MAN is a character from Pac-man. This Pac-Man figure from the Super Smash Bros. series represents PAC-MAN as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Palamute": "Palamute is a character from Monster Hunter. This Palamute figure from the Monster Hunter Rise series represents Palamute as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Palico": "Palico is a character from Monster Hunter. This Palico figure from the Monster Hunter Rise series represents Palico as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Palutena": "Palutena is a character from Kid Icarus. This Palutena figure from the Super Smash Bros. series represents Palutena as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Pancetti": "Pancetti is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Pancetti to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Pango": "Pango is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Pango to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Paolo": "Paolo is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Paolo to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Papi": "Papi is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Papi to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Pascal": "Pascal is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Pascal to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Pashmina": "Pashmina is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Pashmina to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Pate": "Pate is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Pate to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Patty": "Patty is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Patty to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Paula": "Paula is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Paula to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Pave": "Pave is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Pave to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Pawapuro": "Pawapuro is a character from Power Pros. This Pawapuro card from the Power Pros series represents Pawapuro as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Peach": "Princess Peach is the kind-hearted ruler of the Mushroom Kingdom, known for her grace and surprising athletic abilities. This Super Mario Bros. series amiibo represents Peach in their role as a fighter or character across Nintendo's gaming universe.",
  "Peach - Baseball": "Princess Peach is the kind-hearted ruler of the Mushroom Kingdom, known for her grace and surprising athletic abilities. This Mario Sports Superstars series amiibo represents Peach in their role as a fighter or character across Nintendo's gaming universe.",
  "Peach - Cat": "This Peach - Cat amiibo features Peach wearing the Super Bell power-up from Super Mario 3D World. With feline ears, paws, and the ability to climb walls and pounce on enemies, this Super Mario Bros. series figure captures one of Mario's most playful power-ups.",
  "Peach - Golf": "Princess Peach is the kind-hearted ruler of the Mushroom Kingdom, known for her grace and surprising athletic abilities. This Mario Sports Superstars series amiibo represents Peach in their role as a fighter or character across Nintendo's gaming universe.",
  "Peach - Horse Racing": "Princess Peach is the kind-hearted ruler of the Mushroom Kingdom, known for her grace and surprising athletic abilities. This Mario Sports Superstars series amiibo represents Peach in their role as a fighter or character across Nintendo's gaming universe.",
  "Peach - My Mario Wooden Blocks": "Princess Peach is the kind-hearted ruler of the Mushroom Kingdom, known for her grace and surprising athletic abilities. This My Mario Wooden Blocks series amiibo represents Peach in their role as a fighter or character across Nintendo's gaming universe.",
  "Peach - Power Up Band": "Princess Peach is the kind-hearted ruler of the Mushroom Kingdom, known for her grace and surprising athletic abilities. This Super Nintendo World series amiibo represents Peach in their role as a fighter or character across Nintendo's gaming universe.",
  "Peach - Soccer": "Princess Peach is the kind-hearted ruler of the Mushroom Kingdom, known for her grace and surprising athletic abilities. This Mario Sports Superstars series amiibo represents Peach in their role as a fighter or character across Nintendo's gaming universe.",
  "Peach - Tennis": "Princess Peach is the kind-hearted ruler of the Mushroom Kingdom, known for her grace and surprising athletic abilities. This Mario Sports Superstars series amiibo represents Peach in their role as a fighter or character across Nintendo's gaming universe.",
  "Peach - Wedding": "This Peach - Wedding amiibo celebrates Peach's appearance in Super Mario Odyssey's wedding-themed levels. Dressed in formal attire from the Super Mario Bros. series, this figure captures a memorable and lighthearted moment from Mario's globe-trotting adventure.",
  "Peaches": "Peaches is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Peaches to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Peanut": "Peanut is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Peanut to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Pearl": "Pearl is the short but fierce rapper of Off the Hook, the musical duo from Splatoon 2. This Splatoon series amiibo features the tiny but mighty Inkling with her crown and attitude, co-hosting news segments with Marina.",
  "Pearl - Side Order": "Pearl is the short but fierce rapper of Off the Hook, the musical duo from Splatoon 2. This Splatoon series amiibo features the tiny but mighty Inkling with her crown and attitude, co-hosting news segments with Marina.",
  "Pecan": "Pecan is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Pecan to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Peck": "Peck is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Peck to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Peewee": "Peewee is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Peewee to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Peggy": "Peggy is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Peggy to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Pekoe": "Pekoe is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Pekoe to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Pelly": "Pelly is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Pelly to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Penelope": "Penelope is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Penelope to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Pete": "Pete is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Pete to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Petri": "Petri is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Petri to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Phil": "Phil is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Phil to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Phineas": "Phineas is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Phineas to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Phoebe": "Phoebe is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Phoebe to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Phyllis": "Phyllis is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Phyllis to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Pichu": "Pichu is a character from Pokemon. This Pichu figure from the Super Smash Bros. series represents Pichu as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Pierce": "Pierce is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Pierce to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Pietro": "Pietro is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Pietro to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Pikachu": "Pikachu is the Electric-type mouse Pokémon and the beloved mascot of the Pokémon franchise, known for its rosy cheeks and lightning bolt-shaped tail. This Pikachu amiibo represents the Electric Mouse Pokémon as a quick and agile fighter, using Thunderbolt and Quick Attack in Super Smash Bros. battles.",
  "Pikmin": "Pikmin is a character from Pikmin. This Pikmin figure from the Pikmin series represents Pikmin as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Pink Gold Peach - Baseball": "Pink Gold Peach is a character from Mario Sports Superstars. This Pink Gold Peach - Baseball card from the Mario Sports Superstars series represents Pink Gold Peach as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Pink Gold Peach - Golf": "Pink Gold Peach is a character from Mario Sports Superstars. This Pink Gold Peach - Golf card from the Mario Sports Superstars series represents Pink Gold Peach as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Pink Gold Peach - Horse Racing": "Pink Gold Peach is a character from Mario Sports Superstars. This Pink Gold Peach - Horse Racing card from the Mario Sports Superstars series represents Pink Gold Peach as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Pink Gold Peach - Soccer": "Pink Gold Peach is a character from Mario Sports Superstars. This Pink Gold Peach - Soccer card from the Mario Sports Superstars series represents Pink Gold Peach as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Pink Gold Peach - Tennis": "Pink Gold Peach is a character from Mario Sports Superstars. This Pink Gold Peach - Tennis card from the Mario Sports Superstars series represents Pink Gold Peach as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Pink Yarn Yoshi": "This Pink Yarn Yoshi amiibo features Yoshi in an adorable yarn crafted form from Yoshi's Woolly World. Made to look like a hand-knitted plush toy, this Yoshi's Woolly World series figure captures the soft, textile aesthetic of the yarn-based platformer.",
  "Pinky": "Pinky is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Pinky to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Piper": "Piper is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Piper to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Pippy": "Pippy is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Pippy to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Piranha Plant": "Piranha Plant is a character from Super Mario. This Piranha Plant figure from the Super Smash Bros. series represents Piranha Plant as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Pit": "Pit is a character from Kid Icarus. This Pit figure from the Super Smash Bros. series represents Pit as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Plague Knight": "Plague Knight is a character from Shovel Knight. This Plague Knight figure from the Shovel Knight series represents Plague Knight as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Plucky": "Plucky is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Plucky to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Pokemon Trainer": "The Pokémon Trainer is the player character from the Pokémon series. This Super Smash Bros. series amiibo represents the trainer with their three starter Pokémon: Squirtle, Ivysaur, and Charizard, showcasing the evolution journey from beginning to championship.",
  "Pompom": "Pompom is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Pompom to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Poncho": "Poncho is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Poncho to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Poochy": "Poochy is Yoshi's loyal canine companion from Yoshi's Island. This Poochy amiibo captures the adorable helper dog who assists Yoshi throughout his adventures. From the Yoshi's Woolly World series, Poochy has become a fan favorite for his friendly nature and helpful abilities.",
  "Poppy": "Poppy is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Poppy to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Porter": "Porter is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Porter to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Portia": "Portia is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Portia to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Prince": "Prince is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Prince to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Puck": "Puck is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Puck to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Puddles": "Puddles is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Puddles to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Pudge": "Pudge is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Pudge to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Punchy": "Punchy is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Punchy to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Purrl": "Purrl is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Purrl to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Pyra": "Pyra is a character from Xenoblade. This Pyra figure from the Super Smash Bros. series represents Pyra as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Qbby": "Qbby is a character from BoxBoy!. This Qbby figure from the BoxBoy! series represents Qbby as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Queenie": "Queenie is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Queenie to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Quillson": "Quillson is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Quillson to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Quinn": "Quinn is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Quinn to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Qurupeco and Dan": "Qurupeco is a character from Monster Hunter. This Qurupeco and Dan figure from the Monster Hunter series represents Qurupeco as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "R.O.B. - Famicom": "R.O.B. is a character from Classic Nintendo. This R.O.B. - Famicom figure from the Super Smash Bros. series represents R.O.B. as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "R.O.B. - NES": "R.O.B. is a character from Classic Nintendo. This R.O.B. - NES figure from the Super Smash Bros. series represents R.O.B. as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Raddle": "Raddle is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Raddle to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Rasher": "Rasher is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Rasher to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Rashid": "Rashid is a character from Street Fighter. This Rashid card from the Street Fighter 6 series represents Rashid as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Rathian and Cheval": "Rathian is a character from Monster Hunter. This Rathian and Cheval figure from the Monster Hunter series represents Rathian as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Raymond": "Raymond is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Raymond to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Razewing Ratha": "Razewing Ratha is a character from Monster Hunter. This Razewing Ratha figure from the Monster Hunter series represents Razewing Ratha as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Redd": "Redd is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Redd to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Redd - Shirt": "Redd is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Redd to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Reese": "Reese is a character from Animal Crossing. This Reese figure from the Animal Crossing series represents Reese as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Reneigh": "Reneigh is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Reneigh to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Renée": "Renée is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Renée to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Resetti": "Resetti is a character from Animal Crossing. This Resetti figure from the Animal Crossing series represents Resetti as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Resetti - Without Hat": "Resetti is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Resetti to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Revali": "Revali is a character from The Legend of Zelda. This Revali figure from the Legend Of Zelda series represents Revali as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Rex": "Rex is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Rex to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Rhonda": "Rhonda is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Rhonda to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Ribbot": "Ribbot is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Ribbot to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Richter": "Richter Belmont is a legendary vampire hunter from Castlevania. This Super Smash Bros. series amiibo showcases the blue-clad warrior from Rondo of Blood and Symphony of the Night, wielding the Vampire Killer whip against Dracula's armies.",
  "Ricky": "Ricky is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Ricky to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Ridley": "Ridley is the cunning and ruthless leader of the Space Pirates and Samus Aran's arch-nemesis. This Super Smash Bros. series amiibo represents the pterodactyl-like alien who destroyed Samus's home colony, making him one of the Metroid series' most fearsome villains.",
  "Riju": "Riju is a character from The Legend of Zelda. This Riju figure from the Legend Of Zelda series represents Riju as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Rilla": "Rilla is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Rilla to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Rio": "Rio is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Rio to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Rizzo": "Rizzo is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Rizzo to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Roa Kirishima": "Roa Kirishima is a character from Yu-Gi-Oh!. This Roa Kirishima card from the Yu-Gi-Oh! series represents Roa Kirishima as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Roald": "Roald is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Roald to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Robin": "Robin is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Robin to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Rocco": "Rocco is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Rocco to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Rocket": "Rocket is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Rocket to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Rod": "Rod is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Rod to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Rodeo": "Rodeo is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Rodeo to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Rodney": "Rodney is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Rodney to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Rolf": "Rolf is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Rolf to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Romin Kirishima": "Romin Kirishima is a character from Yu-Gi-Oh!. This Romin Kirishima card from the Yu-Gi-Oh! series represents Romin Kirishima as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Rooney": "Rooney is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Rooney to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Rory": "Rory is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Rory to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Rosalina": "Rosalina is a character from Super Mario. This Rosalina figure from the Super Mario Bros. series represents Rosalina as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Rosalina & Luma": "Rosalina is a character from Super Mario. This Rosalina & Luma figure from the Super Smash Bros. series represents Rosalina as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Rosalina - Baseball": "Rosalina is a character from Mario Sports Superstars. This Rosalina - Baseball card from the Mario Sports Superstars series represents Rosalina as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Rosalina - Golf": "Rosalina is a character from Mario Sports Superstars. This Rosalina - Golf card from the Mario Sports Superstars series represents Rosalina as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Rosalina - Horse Racing": "Rosalina is a character from Mario Sports Superstars. This Rosalina - Horse Racing card from the Mario Sports Superstars series represents Rosalina as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Rosalina - Soccer": "Rosalina is a character from Mario Sports Superstars. This Rosalina - Soccer card from the Mario Sports Superstars series represents Rosalina as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Rosalina - Tennis": "Rosalina is a character from Mario Sports Superstars. This Rosalina - Tennis card from the Mario Sports Superstars series represents Rosalina as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Roscoe": "Roscoe is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Roscoe to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Rosie": "Rosie is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Rosie to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Rosie - Amiibo Festival": "Rosie is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Rosie to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Roswell": "Roswell is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Roswell to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Rover": "Rover is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Rover to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Rowan": "Rowan is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Rowan to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Roy": "Roy is one of the seven Koopalings, Bowser's elite commanders. This Super Smash Bros. series amiibo represents Roy as they defend their airships and castles against Mario. Each Koopaling has unique personality and attacks, making them memorable boss battles.",
  "Ruby": "Ruby is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Ruby to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Rudy": "Rudy is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Rudy to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Ryu": "Ryu is the iconic world warrior from Street Fighter. This Super Smash Bros. series amiibo represents the wandering martial artist dedicated to perfecting his technique through training and battle, wielding the Hadoken, Shoryuken, and Tatsumaki Senpukyaku.",
  "Sable": "Sable is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Sable to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Sagat": "Sagat is a character from Street Fighter. This Sagat card from the Street Fighter 6 series represents Sagat as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Saharah": "Saharah is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Saharah to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Sally": "Sally is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Sally to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Samson": "Samson is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Samson to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Samus": "Samus Aran is the legendary bounty hunter from the Metroid series, known for her iconic Power Suit and arm cannon. This Samus amiibo represents the bounty hunter in her full Varia Suit, charging her arm cannon for devastating attacks in Super Smash Bros.",
  "Samus & Vi-O-La": "Samus Aran is the legendary bounty hunter from the Metroid series, known for her iconic Power Suit and arm cannon. This Samus amiibo showcases the intergalactic bounty hunter ready to explore alien worlds and hunt the dangerous Metroids.",
  "Samus - Metroid Dread": "Samus Aran is the legendary bounty hunter from the Metroid series, known for her iconic Power Suit and arm cannon. This Samus amiibo showcases the intergalactic bounty hunter ready to explore alien worlds and hunt the dangerous Metroids.",
  "Samus Aran": "Samus Aran is the legendary bounty hunter from the Metroid series, known for her iconic Power Suit and arm cannon. This Samus amiibo showcases the intergalactic bounty hunter ready to explore alien worlds and hunt the dangerous Metroids.",
  "Sandy": "Sandy is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Sandy to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Sasha": "Sasha is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Sasha to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Savannah": "Savannah is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Savannah to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Scoot": "Scoot is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Scoot to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Sephiroth": "Sephiroth is a character from Final Fantasy. This Sephiroth figure from the Super Smash Bros. series represents Sephiroth as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Shadow Mewtwo": "Shadow Mewtwo is a character from Pokemon. This Shadow Mewtwo card from the Pokemon series represents Shadow Mewtwo as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Shari": "Shari is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Shari to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Sheik": "Zelda is a character from The Legend of Zelda. This Sheik figure from the Super Smash Bros. series represents Zelda as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Sheldon": "Sheldon is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Sheldon to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Shep": "Shep is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Shep to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Sherb": "Sherb is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Sherb to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Shino": "Shino is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Shino to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Shiver": "Shiver is a character from Splatoon. This Shiver figure from the Splatoon series represents Shiver as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Shovel Knight": "Shovel Knight is the indie gaming icon who wields the Shovel Blade. This Shovel Knight series amiibo represents the blue-armored knight on his quest to rescue Shield Knight and defeat the Enchantress, combining retro NES aesthetics with modern game design.",
  "Shovel Knight - Gold Edition": "Shovel Knight is the indie gaming icon who wields the Shovel Blade. This Shovel Knight series amiibo represents the blue-armored knight on his quest to rescue Shield Knight and defeat the Enchantress, combining retro NES aesthetics with modern game design.",
  "Shrunk": "Shrunk is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Shrunk to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Shrunk - Loud Jacket": "Shrunk is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Shrunk to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Shulk": "Shulk is a character from Xenoblade. This Shulk figure from the Super Smash Bros. series represents Shulk as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Sidon": "Sidon is a character from The Legend of Zelda. This Sidon figure from the Legend Of Zelda series represents Sidon as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Simon": "Simon Belmont is one of the legendary vampire hunters from Castlevania. This Super Smash Bros. series amiibo represents the whip-wielding hero who battles Dracula and his forces of darkness with holy weapons and the Vampire Killer whip.",
  "Skye": "Skye is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Skye to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Sly": "Sly is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Sly to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Smallfry": "Smallfry is a character from Splatoon. This Smallfry figure from the Splatoon series represents Smallfry as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Snake": "Solid Snake is the legendary soldier from Metal Gear Solid. This Super Smash Bros. series amiibo represents the stealth expert who infiltrates enemy bases to prevent nuclear threats, known for his tactical genius and iconic codec conversations.",
  "Snooty": "Snooty is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Snooty to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Solaire of Astora": "Solaire of Astora is a character from Dark Souls. This Solaire of Astora figure from the Others series represents Solaire of Astora as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Soleil": "Soleil is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Soleil to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Sonic": "Sonic the Hedgehog is SEGA's blue blur mascot. This Super Smash Bros. series amiibo represents the fastest thing alive, speeding through zones collecting rings while stopping Dr. Eggman's schemes. Sonic's inclusion in Smash Bros. represents a historic gaming crossover.",
  "Sora": "Sora is a character from Kingdom Hearts. This Sora figure from the Super Smash Bros. series represents Sora as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Sparro": "Sparro is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Sparro to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Specter Knight": "Specter Knight is a character from Shovel Knight. This Specter Knight figure from the Shovel Knight series represents Specter Knight as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Spike": "Spike is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Spike to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Spork/Crackle": "Spork/Crackle is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Spork/Crackle to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Sprinkle": "Sprinkle is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Sprinkle to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Sprocket": "Sprocket is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Sprocket to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Squirtle": "Squirtle is the Tiny Turtle Pokémon and one of the original starter Pokémon. This Super Smash Bros. series amiibo features the adorable Water-type with its shell and tail, ready to spray water attacks at opponents.",
  "Static": "Static is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Static to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Stella": "Stella is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Stella to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Sterling": "Sterling is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Sterling to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Steve": "Steve is the default player character from Minecraft. This Super Smash Bros. series amiibo represents the blocky avatar who can mine, craft, and build anything imaginable in the world's best-selling video game.",
  "Stinky": "Stinky is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Stinky to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Stitches": "Stitches is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Stitches to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Stitches - Amiibo Festival": "Stitches is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Stitches to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Stu": "Stu is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Stu to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Super Mario Cereal": "Mario Cereal is a character from Kellogs. This Super Mario Cereal card from the Others series represents Mario Cereal as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Sydney": "Sydney is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Sydney to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Sylux": "Sylux is a character from Metroid. This Sylux figure from the Metroid series represents Sylux as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Sylvana": "Sylvana is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Sylvana to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Sylvia": "Sylvia is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Sylvia to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "T-Bone": "T-Bone is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite T-Bone to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Tabby": "Tabby is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Tabby to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Tad": "Tad is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Tad to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Tammi": "Tammi is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Tammi to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Tammy": "Tammy is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Tammy to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Tangy": "Tangy is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Tangy to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Tank": "Tank is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Tank to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Tasha": "Tasha is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Tasha to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Tatsuhisa “Luke” Kamijō": "Tatsuhisa “Luke” Kamijō is a character from Yu-Gi-Oh!. This Tatsuhisa “Luke” Kamijō card from the Yu-Gi-Oh! series represents Tatsuhisa “Luke” Kamijō as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Teddy": "Teddy is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Teddy to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Terry": "Terry is a character from Fatal Fury. This Terry figure from the Super Smash Bros. series represents Terry as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Tex": "Tex is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Tex to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Tia": "Tia is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Tia to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Tiansheng": "Tiansheng is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Tiansheng to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Tiffany": "Tiffany is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Tiffany to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Tiki": "Tiki is a character from Fire Emblem. This Tiki figure from the Fire Emblem series represents Tiki as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Timbra": "Timbra is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Timbra to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Timmy": "Timmy is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Timmy to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Timmy & Tommy": "Timmy & Tommy is a character from Animal Crossing. This Timmy & Tommy figure from the Animal Crossing series represents Timmy & Tommy as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Timmy - Full Apron": "Timmy is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Timmy to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Timmy - Suit": "Timmy is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Timmy to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Tipper": "Tipper is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Tipper to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Toad": "Toad is a character from Super Mario. This Toad figure from the Super Mario Bros. series represents Toad as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Toad - Power Up Band": "Toad is a character from Super Mario. This Toad - Power Up Band band from the Super Nintendo World series represents Toad as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Toby": "Toby is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Toby to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Tom": "Tom is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Tom to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Tom Nook": "Tom Nook is the entrepreneurial tanuki who helps players get started in Animal Crossing. This Animal Crossing series amiibo represents the business-savvy raccoon dog who offers home loans and manages the island economy, often working late into the night for his residents.",
  "Tom Nook - Coat": "Tom Nook is the entrepreneurial tanuki who helps players get started in Animal Crossing. This Animal Crossing series amiibo represents the business-savvy raccoon dog who offers home loans and manages the island economy, often working late into the night for his residents.",
  "Tom Nook - Jacket": "Tom Nook is the entrepreneurial tanuki who helps players get started in Animal Crossing. This Animal Crossing series amiibo represents the business-savvy raccoon dog who offers home loans and manages the island economy, often working late into the night for his residents.",
  "Tommy - Suit": "Tommy is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Tommy to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Tommy - Uniform": "Tommy is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Tommy to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Toon Link": "Toon Link is the cel-shaded incarnation of Link from The Legend of Zelda series. This Super Smash Bros. series amiibo showcases the young hero's expressive design and adventurous spirit in a charming, cartoonish art style.",
  "Toon Link - The Wind Waker": "This Toon Link amiibo features the cel-shaded hero from The Legend of Zelda: The Wind Waker. With his expressive animations and seafaring adventures, this Legend Of Zelda series figure captures Link's cartoony charm as he sails the Great Sea.",
  "Toon Zelda - The Wind Waker": "Zelda is a character from The Legend of Zelda. This Toon Zelda - The Wind Waker figure from the Legend Of Zelda series represents Zelda as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Tortimer": "Tortimer is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Tortimer to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Truffles": "Truffles is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Truffles to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Tsukino": "Tsukino is a character from Monster Hunter. This Tsukino figure from the Monster Hunter series represents Tsukino as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Tucker": "Tucker is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Tucker to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Tulin": "Tulin is a character from The Legend of Zelda. This Tulin figure from the Legend Of Zelda series represents Tulin as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Turbo Charge Donkey Kong": "Donkey Kong is the powerful leader of the Kong family, known for his incredible strength and his mission to protect his banana hoard. This Skylanders series amiibo represents Donkey Kong in their role as a fighter or character across Nintendo's gaming universe.",
  "Tutu": "Tutu is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Tutu to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Twiggy": "Twiggy is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Twiggy to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Tybalt": "Tybalt is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Tybalt to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Urbosa": "Urbosa is a character from The Legend of Zelda. This Urbosa figure from the Legend Of Zelda series represents Urbosa as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Ursala": "Ursala is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Ursala to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Velma": "Velma is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Velma to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Vesta": "Vesta is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Vesta to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Vic": "Vic is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Vic to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Victoria": "Victoria is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Victoria to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Villager": "Villager is a character from Animal Crossing. This Villager figure from the Super Smash Bros. series represents Villager as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Violet": "Violet is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Violet to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Vivian": "Vivian is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Vivian to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Vladimir": "Vladimir is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Vladimir to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Waddle Dee": "Bandana Waddle Dee (also known as Bandana Dee) is King Dedede's loyal spear-wielding servant who has become a hero in his own right. This Kirby series amiibo represents the brave Waddle Dee who joins Kirby and friends on adventures to protect Dream Land.",
  "Wade": "Wade is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Wade to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Walker": "Walker is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Walker to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Walt": "Walt is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Walt to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Waluigi": "Waluigi is a character from Super Mario. This Waluigi figure from the Super Mario Bros. series represents Waluigi as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Waluigi - Baseball": "Waluigi is a character from Mario Sports Superstars. This Waluigi - Baseball card from the Mario Sports Superstars series represents Waluigi as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Waluigi - Golf": "Waluigi is a character from Mario Sports Superstars. This Waluigi - Golf card from the Mario Sports Superstars series represents Waluigi as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Waluigi - Horse Racing": "Waluigi is a character from Mario Sports Superstars. This Waluigi - Horse Racing card from the Mario Sports Superstars series represents Waluigi as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Waluigi - Soccer": "Waluigi is a character from Mario Sports Superstars. This Waluigi - Soccer card from the Mario Sports Superstars series represents Waluigi as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Waluigi - Tennis": "Waluigi is a character from Mario Sports Superstars. This Waluigi - Tennis card from the Mario Sports Superstars series represents Waluigi as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Wardell": "Wardell is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Wardell to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Wario": "Wario is a character from Super Mario. This Wario figure from the Super Smash Bros. series represents Wario as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Wario - Baseball": "Wario is a character from Mario Sports Superstars. This Wario - Baseball card from the Mario Sports Superstars series represents Wario as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Wario - Golf": "Wario is a character from Mario Sports Superstars. This Wario - Golf card from the Mario Sports Superstars series represents Wario as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Wario - Horse Racing": "Wario is a character from Mario Sports Superstars. This Wario - Horse Racing card from the Mario Sports Superstars series represents Wario as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Wario - Soccer": "Wario is a character from Mario Sports Superstars. This Wario - Soccer card from the Mario Sports Superstars series represents Wario as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Wario - Tennis": "Wario is a character from Mario Sports Superstars. This Wario - Tennis card from the Mario Sports Superstars series represents Wario as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Wart Jr.": "Wart Jr. is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Wart Jr. to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Weber": "Weber is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Weber to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Wendell": "Wendell is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Wendell to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Wendy": "Wendy is one of the seven Koopalings, Bowser's elite commanders. This Animal Crossing series amiibo represents Wendy as they defend their airships and castles against Mario. Each Koopaling has unique personality and attacks, making them memorable boss battles.",
  "Whitney": "Whitney is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Whitney to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Wii Fit Trainer": "Wii Fit Trainer is a character from Wii Fit. This Wii Fit Trainer figure from the Super Smash Bros. series represents Wii Fit Trainer as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Wilbur": "Wilbur is a endearing villager from Animal Crossing. This Animal Crossing series card allows players to invite Wilbur to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Willow": "Willow is a lovable villager from Animal Crossing. This Animal Crossing series card allows players to invite Willow to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Winnie": "Winnie is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Winnie to their island or campsite, where they can befriend this unique resident and enjoy fishing, bug catching, and decorating together. Each villager brings their own personality and style to the community.",
  "Wisp": "Wisp is a kind-hearted villager from Animal Crossing. This Animal Crossing series card allows players to invite Wisp to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Wolf": "Wolf O'Donnell is the leader of Star Wolf, Fox McCloud's rival mercenary team. This Super Smash Bros. series amiibo represents the skilled pilot who serves as Star Fox's persistent antagonist and occasional reluctant ally in the fight against greater threats.",
  "Wolfgang": "Wolfgang is a cheerful villager from Animal Crossing. This Animal Crossing series card allows players to invite Wolfgang to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Yabe": "Yabe is a character from Power Pros. This Yabe card from the Power Pros series represents Yabe as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Yoshi": "Yoshi is Mario's loyal dinosaur companion, known for his long tongue, egg-laying ability, and cheerful nature. This Yoshi amiibo represents the friendly dinosaur as a mid-weight fighter in Super Smash Bros., using his signature flutter jump and egg throw.",
  "Yoshi - Baseball": "Yoshi is Mario's loyal dinosaur companion, known for his long tongue, egg-laying ability, and cheerful nature. This Mario Sports Superstars series amiibo represents Yoshi in their role as a fighter or character across Nintendo's gaming universe.",
  "Yoshi - Golf": "Yoshi is Mario's loyal dinosaur companion, known for his long tongue, egg-laying ability, and cheerful nature. This Mario Sports Superstars series amiibo represents Yoshi in their role as a fighter or character across Nintendo's gaming universe.",
  "Yoshi - Horse Racing": "Yoshi is Mario's loyal dinosaur companion, known for his long tongue, egg-laying ability, and cheerful nature. This Mario Sports Superstars series amiibo represents Yoshi in their role as a fighter or character across Nintendo's gaming universe.",
  "Yoshi - My Mario Wooden Blocks": "Yoshi is Mario's loyal dinosaur companion, known for his long tongue, egg-laying ability, and cheerful nature. This My Mario Wooden Blocks series amiibo represents Yoshi in their role as a fighter or character across Nintendo's gaming universe.",
  "Yoshi - Power Up Band": "Yoshi is Mario's loyal dinosaur companion, known for his long tongue, egg-laying ability, and cheerful nature. This Super Nintendo World series amiibo represents Yoshi in their role as a fighter or character across Nintendo's gaming universe.",
  "Yoshi - Soccer": "Yoshi is Mario's loyal dinosaur companion, known for his long tongue, egg-laying ability, and cheerful nature. This Mario Sports Superstars series amiibo represents Yoshi in their role as a fighter or character across Nintendo's gaming universe.",
  "Yoshi - Tennis": "Yoshi is Mario's loyal dinosaur companion, known for his long tongue, egg-laying ability, and cheerful nature. This Mario Sports Superstars series amiibo represents Yoshi in their role as a fighter or character across Nintendo's gaming universe.",
  "Young Link": "Link is the courageous hero of The Legend of Zelda series, destined to battle evil and save the kingdom of Hyrule across multiple timelines and incarnations. This Link amiibo represents the Hero of Time as a fierce fighter, wielding his Master Sword and Hylian Shield in Super Smash Bros. battles.",
  "Yuga Ohdo": "Yuga Ohdo is a character from Yu-Gi-Oh!. This Yuga Ohdo card from the Yu-Gi-Oh! series represents Yuga Ohdo as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Yuka": "Yuka is a quirky villager from Animal Crossing. This Animal Crossing series card allows players to invite Yuka to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Yunobo": "Yunobo is a character from The Legend of Zelda. This Yunobo figure from the Legend Of Zelda series represents Yunobo as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Zangief": "Zangief is a character from Street Fighter. This Zangief card from the Street Fighter 6 series represents Zangief as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Zelda": "Zelda is a character from The Legend of Zelda. This Zelda figure from the Legend Of Zelda series represents Zelda as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Zelda & Loftwing": "Zelda is a character from The Legend of Zelda. This Zelda & Loftwing figure from the Legend Of Zelda series represents Zelda as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Zelda - Tears of the Kingdom": "Zelda is a character from The Legend of Zelda. This Zelda - Tears of the Kingdom figure from the Legend Of Zelda series represents Zelda as they appear in Nintendo's gaming universe, bringing unique gameplay interactions and collectible value to amiibo enthusiasts.",
  "Zell": "Zell is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Zell to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Zero Suit Samus": "This Zero Suit Samus amiibo features Samus Aran without her Power Suit, wearing her blue Zero Suit. From the Super Smash Bros. series, this figure showcases Samus's agility and athletic prowess when not encased in her iconic armor.",
  "Zipper": "Zipper is a charming villager from Animal Crossing. This Animal Crossing series card allows players to invite Zipper to their island or campsite, where they can befriend this unique resident and enjoy daily activities, festivals, and island life together. Each villager brings their own personality and style to the community.",
  "Zoe": "Zoe is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Zoe to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community.",
  "Zucker": "Zucker is a friendly villager from Animal Crossing. This Animal Crossing series card allows players to invite Zucker to their island or campsite, where they can befriend this unique resident and enjoy participating in seasonal events and community activities together. Each villager brings their own personality and style to the community.",
  "Étoile": "Étoile is a delightful villager from Animal Crossing. This Animal Crossing series card allows players to invite Étoile to their island or campsite, where they can befriend this unique resident and enjoy building friendships and enjoying island living together. Each villager brings their own personality and style to the community."
}